LuckkMaker/betaflight/lib/main/APM32F4/Libraries/Device/Geehy/APM32F4xx/Include/apm32f423xx.h
/*******************  Bit definition for ADC_INJDATA1 register  *******************/
#define ADC_INJDATA1_INJDATA_Pos                                    (0U)
#define ADC_INJDATA1_INJDATA_Msk                                    (0xFFFFUL << ADC_INJDATA1_INJDATA_Pos)                         /*!< 0x0000FFFF */
#define ADC_INJDATA1_INJDATA                                        ADC_INJDATA1_INJDATA_Msk                                       /*!<Injected data */

/*******************  Bit definition for ADC_INJDATA2 register  *******************/
#define ADC_INJDATA2_INJDATA_Pos                                    (0U)
#define ADC_INJDATA2_INJDATA_Msk                                    (0xFFFFUL << ADC_INJDATA2_INJDATA_Pos)                         /*!< 0x0000FFFF */
#define ADC_INJDATA2_INJDATA                                        ADC_INJDATA2_INJDATA_Msk                                       /*!<Injected data */

/*******************  Bit definition for ADC_INJDATA3 register  *******************/
#define ADC_INJDATA3_INJDATA_Pos                                    (0U)
#define ADC_INJDATA3_INJDATA_Msk                                    (0xFFFFUL << ADC_INJDATA3_INJDATA_Pos)                         /*!< 0x0000FFFF */
#define ADC_INJDATA3_INJDATA                                        ADC_INJDATA3_INJDATA_Msk                                       /*!<Injected data */

/*******************  Bit definition for ADC_INJDATA4 register  *******************/
#define ADC_INJDATA4_INJDATA_Pos                                    (0U)
#define ADC_INJDATA4_INJDATA_Msk                                    (0xFFFFUL << ADC_INJDATA4_INJDATA_Pos)                         /*!< 0x0000FFFF */
#define ADC_INJDATA4_INJDATA                                        ADC_INJDATA4_INJDATA_Msk                                       /*!<Injected data */

/********************  Bit definition for ADC_REGDATA register  ********************/
#define ADC_REGDATA_REGDATA_Pos                                     (0U)
#define ADC_REGDATA_REGDATA_Msk                                     (0xFFFFUL << ADC_REGDATA_REGDATA_Pos)                          /*!< 0x0000FFFF */
#define ADC_REGDATA_REGDATA                                         ADC_REGDATA_REGDATA_Msk                                        /*!<Regular data */
#define ADC_REGDATA_ADC2DATA_Pos                                    (16U)
#define ADC_REGDATA_ADC2DATA_Msk                                    (0xFFFFUL << ADC_REGDATA_ADC2DATA_Pos)                         /*!< 0xFFFF0000 */
#define ADC_REGDATA_ADC2DATA                                        ADC_REGDATA_ADC2DATA_Msk                                       /*!<ADC2 data */

/*******************  Bit definition for ADC_OSAMPCTRL register  ********************/
#define ADC_OSAMPCTRL_OSEN_Pos                                      (0U)
#define ADC_OSAMPCTRL_OSEN_Msk                                      (0x1UL << ADC_OSAMPCTRL_OSEN_Pos)                               /*!< 0x00000001 */
#define ADC_OSAMPCTRL_OSEN                                          ADC_OSAMPCTRL_OSEN_Msk                                          /*!<ADC oversampling enable */
#define ADC_OSAMPCTRL_OSR_Pos                                       (1U)
#define ADC_OSAMPCTRL_OSR_Msk                                       (0x7UL << ADC_OSAMPCTRL_OSR_Pos)                                /*!< 0x0000000E */
#define ADC_OSAMPCTRL_OSR                                           ADC_OSAMPCTRL_OSR_Msk                                           /*!<ADC Oversampling ratio */
#define ADC_OSAMPCTRL_OSR_0                                         (0x1UL << ADC_OSAMPCTRL_OSR_Pos)                                /*!< 0x00000002 */
#define ADC_OSAMPCTRL_OSR_1                                         (0x2UL << ADC_OSAMPCTRL_OSR_Pos)                                /*!< 0x00000004 */
#define ADC_OSAMPCTRL_OSR_2                                         (0x4UL << ADC_OSAMPCTRL_OSR_Pos)                                /*!< 0x00000008 */
#define ADC_OSAMPCTRL_OSS_Pos                                       (4U)
#define ADC_OSAMPCTRL_OSS_Msk                                       (0xFUL << ADC_OSAMPCTRL_OSS_Pos)                                /*!< 0x000000F0 */
#define ADC_OSAMPCTRL_OSS                                           ADC_OSAMPCTRL_OSS_Msk                                           /*!<ADC oversampling shift */
#define ADC_OSAMPCTRL_OSS_0                                         (0x1UL << ADC_OSAMPCTRL_OSS_Pos)                                /*!< 0x00000010 */
#define ADC_OSAMPCTRL_OSS_1                                         (0x2UL << ADC_OSAMPCTRL_OSS_Pos)                                /*!< 0x00000020 */
#define ADC_OSAMPCTRL_OSS_2                                         (0x4UL << ADC_OSAMPCTRL_OSS_Pos)                                /*!< 0x00000040 */
#define ADC_OSAMPCTRL_OSS_3                                         (0x8UL << ADC_OSAMPCTRL_OSS_Pos)                                /*!< 0x00000080 */
#define ADC_OSAMPCTRL_TOS_Pos                                       (8U)
#define ADC_OSAMPCTRL_TOS_Msk                                       (0x1UL << ADC_OSAMPCTRL_TOS_Pos)                                /*!< 0x00000100 */
#define ADC_OSAMPCTRL_TOS                                           ADC_OSAMPCTRL_TOS_Msk                                           /*!<ADC oversampling trigger */

/*******************  Bit definition for ADC_CSTS register  ********************/
#define ADC_CSTS_AWDFLG1_Pos                                        (0U)
#define ADC_CSTS_AWDFLG1_Msk                                        (0x1UL << ADC_CSTS_AWDFLG1_Pos)                                /*!< 0x00000001 */
#define ADC_CSTS_AWDFLG1                                            ADC_CSTS_AWDFLG1_Msk                                           /*!<ADC1 Analog watchdog flag */
#define ADC_CSTS_EOCFLG1_Pos                                        (1U)
#define ADC_CSTS_EOCFLG1_Msk                                        (0x1UL << ADC_CSTS_EOCFLG1_Pos)                                /*!< 0x00000002 */
#define ADC_CSTS_EOCFLG1                                            ADC_CSTS_EOCFLG1_Msk                                           /*!<ADC1 End of conversion */
#define ADC_CSTS_INJEOCFLG1_Pos                                     (2U)
#define ADC_CSTS_INJEOCFLG1_Msk                                     (0x1UL << ADC_CSTS_INJEOCFLG1_Pos)                             /*!< 0x00000004 */
#define ADC_CSTS_INJEOCFLG1                                         ADC_CSTS_INJEOCFLG1_Msk                                        /*!<ADC1 Injected channel end of conversion */
#define ADC_CSTS_INJCSFLG1_Pos                                      (3U)
#define ADC_CSTS_INJCSFLG1_Msk                                      (0x1UL << ADC_CSTS_INJCSFLG1_Pos)                              /*!< 0x00000008 */
#define ADC_CSTS_INJCSFLG1                                          ADC_CSTS_INJCSFLG1_Msk                                         /*!<ADC1 Injected channel Start flag */
#define ADC_CSTS_REGCSFLG1_Pos                                      (4U)
#define ADC_CSTS_REGCSFLG1_Msk                                      (0x1UL << ADC_CSTS_REGCSFLG1_Pos)                              /*!< 0x00000010 */
#define ADC_CSTS_REGCSFLG1                                          ADC_CSTS_REGCSFLG1_Msk                                         /*!<ADC1 Regular channel Start flag */
#define ADC_CSTS_OVRFLG1_Pos                                        (5U)
#define ADC_CSTS_OVRFLG1_Msk                                        (0x1UL << ADC_CSTS_OVRFLG1_Pos)                                /*!< 0x00000020 */
#define ADC_CSTS_OVRFLG1                                            ADC_CSTS_OVRFLG1_Msk                                           /*!<ADC1 DMA overrun  flag */
#define ADC_CSTS_AWDFLG2_Pos                                        (8U)
#define ADC_CSTS_AWDFLG2_Msk                                        (0x1UL << ADC_CSTS_AWDFLG2_Pos)                                /*!< 0x00000100 */
#define ADC_CSTS_AWDFLG2                                            ADC_CSTS_AWDFLG2_Msk                                           /*!<ADC2 Analog watchdog flag */
#define ADC_CSTS_EOCFLG2_Pos                                        (9U)
#define ADC_CSTS_EOCFLG2_Msk                                        (0x1UL << ADC_CSTS_EOCFLG2_Pos)                                /*!< 0x00000200 */
#define ADC_CSTS_EOCFLG2                                            ADC_CSTS_EOCFLG2_Msk                                           /*!<ADC2 End of conversion */
#define ADC_CSTS_INJEOCFLG2_Pos                                     (10U)
#define ADC_CSTS_INJEOCFLG2_Msk                                     (0x1UL << ADC_CSTS_INJEOCFLG2_Pos)                             /*!< 0x00000400 */
#define ADC_CSTS_INJEOCFLG2                                         ADC_CSTS_INJEOCFLG2_Msk                                        /*!<ADC2 Injected channel end of conversion */
#define ADC_CSTS_INJCSFLG2_Pos                                      (11U)
#define ADC_CSTS_INJCSFLG2_Msk                                      (0x1UL << ADC_CSTS_INJCSFLG2_Pos)                              /*!< 0x00000800 */
#define ADC_CSTS_INJCSFLG2                                          ADC_CSTS_INJCSFLG2_Msk                                         /*!<ADC2 Injected channel Start flag */
#define ADC_CSTS_REGCSFLG2_Pos                                      (12U)
#define ADC_CSTS_REGCSFLG2_Msk                                      (0x1UL << ADC_CSTS_REGCSFLG2_Pos)                              /*!< 0x00001000 */
#define ADC_CSTS_REGCSFLG2                                          ADC_CSTS_REGCSFLG2_Msk                                         /*!<ADC2 Regular channel Start flag */
#define ADC_CSTS_OVRFLG2_Pos                                        (13U)
#define ADC_CSTS_OVRFLG2_Msk                                        (0x1UL << ADC_CSTS_OVRFLG2_Pos)                                /*!< 0x00002000 */
#define ADC_CSTS_OVRFLG2                                            ADC_CSTS_OVRFLG2_Msk                                           /*!<ADC2 DMA overrun  flag */
#define ADC_CSTS_AWDFLG3_Pos                                        (16U)
#define ADC_CSTS_AWDFLG3_Msk                                        (0x1UL << ADC_CSTS_AWDFLG3_Pos)                                /*!< 0x00010000 */
#define ADC_CSTS_AWDFLG3                                            ADC_CSTS_AWDFLG3_Msk                                           /*!<ADC3 Analog watchdog flag */
#define ADC_CSTS_EOCFLG3_Pos                                        (17U)
#define ADC_CSTS_EOCFLG3_Msk                                        (0x1UL << ADC_CSTS_EOCFLG3_Pos)                                /*!< 0x00020000 */
#define ADC_CSTS_EOCFLG3                                            ADC_CSTS_EOCFLG3_Msk                                           /*!<ADC3 End of conversion */
#define ADC_CSTS_INJEOCFLG3_Pos                                     (18U)
#define ADC_CSTS_INJEOCFLG3_Msk                                     (0x1UL << ADC_CSTS_INJEOCFLG3_Pos)                             /*!< 0x00040000 */
#define ADC_CSTS_INJEOCFLG3                                         ADC_CSTS_INJEOCFLG3_Msk                                        /*!<ADC3 Injected channel end of conversion */
#define ADC_CSTS_INJCSFLG3_Pos                                      (19U)
#define ADC_CSTS_INJCSFLG3_Msk                                      (0x1UL << ADC_CSTS_INJCSFLG3_Pos)                              /*!< 0x00080000 */
#define ADC_CSTS_INJCSFLG3                                          ADC_CSTS_INJCSFLG3_Msk                                         /*!<ADC3 Injected channel Start flag */
#define ADC_CSTS_REGCSFLG3_Pos                                      (20U)
#define ADC_CSTS_REGCSFLG3_Msk                                      (0x1UL << ADC_CSTS_REGCSFLG3_Pos)                              /*!< 0x00100000 */
#define ADC_CSTS_REGCSFLG3                                          ADC_CSTS_REGCSFLG3_Msk                                         /*!<ADC3 Regular channel Start flag */
#define ADC_CSTS_OVRFLG3_Pos                                        (21U)
#define ADC_CSTS_OVRFLG3_Msk                                        (0x1UL << ADC_CSTS_OVRFLG3_Pos)                                /*!< 0x00200000 */
#define ADC_CSTS_OVRFLG3                                            ADC_CSTS_OVRFLG3_Msk                                           /*!<ADC3 DMA overrun  flag */

