LuckkMaker/betaflight/lib/main/APM32F4/Libraries/Device/Geehy/APM32F4xx/Include/apm32f423xx.h
/******************  Bit definition for CAN_FFASS register  *******************/
#define CAN_FFASS_FFASS_Pos                                         (0U)
#define CAN_FFASS_FFASS_Msk                                         (0xFFFFFFFUL << CAN_FFASS_FFASS_Pos)                           /*!< 0x0FFFFFFF */
#define CAN_FFASS_FFASS                                             CAN_FFASS_FFASS_Msk                                            /*!<Filter FIFO Assignment */
#define CAN_FFASS_FFASS0_Pos                                        (0U)
#define CAN_FFASS_FFASS0_Msk                                        (0x1UL << CAN_FFASS_FFASS0_Pos)                                /*!< 0x00000001 */
#define CAN_FFASS_FFASS0                                            CAN_FFASS_FFASS0_Msk                                           /*!<Filter FIFO Assignment bit 0 */
#define CAN_FFASS_FFASS1_Pos                                        (1U)
#define CAN_FFASS_FFASS1_Msk                                        (0x1UL << CAN_FFASS_FFASS1_Pos)                                /*!< 0x00000002 */
#define CAN_FFASS_FFASS1                                            CAN_FFASS_FFASS1_Msk                                           /*!<Filter FIFO Assignment bit 1 */
#define CAN_FFASS_FFASS2_Pos                                        (2U)
#define CAN_FFASS_FFASS2_Msk                                        (0x1UL << CAN_FFASS_FFASS2_Pos)                                /*!< 0x00000004 */
#define CAN_FFASS_FFASS2                                            CAN_FFASS_FFASS2_Msk                                           /*!<Filter FIFO Assignment bit 2 */
#define CAN_FFASS_FFASS3_Pos                                        (3U)
#define CAN_FFASS_FFASS3_Msk                                        (0x1UL << CAN_FFASS_FFASS3_Pos)                                /*!< 0x00000008 */
#define CAN_FFASS_FFASS3                                            CAN_FFASS_FFASS3_Msk                                           /*!<Filter FIFO Assignment bit 3 */
#define CAN_FFASS_FFASS4_Pos                                        (4U)
#define CAN_FFASS_FFASS4_Msk                                        (0x1UL << CAN_FFASS_FFASS4_Pos)                                /*!< 0x00000010 */
#define CAN_FFASS_FFASS4                                            CAN_FFASS_FFASS4_Msk                                           /*!<Filter FIFO Assignment bit 4 */
#define CAN_FFASS_FFASS5_Pos                                        (5U)
#define CAN_FFASS_FFASS5_Msk                                        (0x1UL << CAN_FFASS_FFASS5_Pos)                                /*!< 0x00000020 */
#define CAN_FFASS_FFASS5                                            CAN_FFASS_FFASS5_Msk                                           /*!<Filter FIFO Assignment bit 5 */
#define CAN_FFASS_FFASS6_Pos                                        (6U)
#define CAN_FFASS_FFASS6_Msk                                        (0x1UL << CAN_FFASS_FFASS6_Pos)                                /*!< 0x00000040 */
#define CAN_FFASS_FFASS6                                            CAN_FFASS_FFASS6_Msk                                           /*!<Filter FIFO Assignment bit 6 */
#define CAN_FFASS_FFASS7_Pos                                        (7U)
#define CAN_FFASS_FFASS7_Msk                                        (0x1UL << CAN_FFASS_FFASS7_Pos)                                /*!< 0x00000080 */
#define CAN_FFASS_FFASS7                                            CAN_FFASS_FFASS7_Msk                                           /*!<Filter FIFO Assignment bit 7 */
#define CAN_FFASS_FFASS8_Pos                                        (8U)
#define CAN_FFASS_FFASS8_Msk                                        (0x1UL << CAN_FFASS_FFASS8_Pos)                                /*!< 0x00000100 */
#define CAN_FFASS_FFASS8                                            CAN_FFASS_FFASS8_Msk                                           /*!<Filter FIFO Assignment bit 8 */
#define CAN_FFASS_FFASS9_Pos                                        (9U)
#define CAN_FFASS_FFASS9_Msk                                        (0x1UL << CAN_FFASS_FFASS9_Pos)                                /*!< 0x00000200 */
#define CAN_FFASS_FFASS9                                            CAN_FFASS_FFASS9_Msk                                           /*!<Filter FIFO Assignment bit 9 */
#define CAN_FFASS_FFASS10_Pos                                       (10U)
#define CAN_FFASS_FFASS10_Msk                                       (0x1UL << CAN_FFASS_FFASS10_Pos)                               /*!< 0x00000400 */
#define CAN_FFASS_FFASS10                                           CAN_FFASS_FFASS10_Msk                                          /*!<Filter FIFO Assignment bit 10 */
#define CAN_FFASS_FFASS11_Pos                                       (11U)
#define CAN_FFASS_FFASS11_Msk                                       (0x1UL << CAN_FFASS_FFASS11_Pos)                               /*!< 0x00000800 */
#define CAN_FFASS_FFASS11                                           CAN_FFASS_FFASS11_Msk                                          /*!<Filter FIFO Assignment bit 11 */
#define CAN_FFASS_FFASS12_Pos                                       (12U)
#define CAN_FFASS_FFASS12_Msk                                       (0x1UL << CAN_FFASS_FFASS12_Pos)                               /*!< 0x00001000 */
#define CAN_FFASS_FFASS12                                           CAN_FFASS_FFASS12_Msk                                          /*!<Filter FIFO Assignment bit 12 */
#define CAN_FFASS_FFASS13_Pos                                       (13U)
#define CAN_FFASS_FFASS13_Msk                                       (0x1UL << CAN_FFASS_FFASS13_Pos)                               /*!< 0x00002000 */
#define CAN_FFASS_FFASS13                                           CAN_FFASS_FFASS13_Msk                                          /*!<Filter FIFO Assignment bit 13 */
#define CAN_FFASS_FFASS14_Pos                                       (14U)
#define CAN_FFASS_FFASS14_Msk                                       (0x1UL << CAN_FFASS_FFASS14_Pos)                               /*!< 0x00004000 */
#define CAN_FFASS_FFASS14                                           CAN_FFASS_FFASS14_Msk                                          /*!<Filter FIFO Assignment bit 14 */
#define CAN_FFASS_FFASS15_Pos                                       (15U)
#define CAN_FFASS_FFASS15_Msk                                       (0x1UL << CAN_FFASS_FFASS15_Pos)                               /*!< 0x00008000 */
#define CAN_FFASS_FFASS15                                           CAN_FFASS_FFASS15_Msk                                          /*!<Filter FIFO Assignment bit 15 */
#define CAN_FFASS_FFASS16_Pos                                       (16U)
#define CAN_FFASS_FFASS16_Msk                                       (0x1UL << CAN_FFASS_FFASS16_Pos)                               /*!< 0x00010000 */
#define CAN_FFASS_FFASS16                                           CAN_FFASS_FFASS16_Msk                                          /*!<Filter FIFO Assignment bit 16 */
#define CAN_FFASS_FFASS17_Pos                                       (17U)
#define CAN_FFASS_FFASS17_Msk                                       (0x1UL << CAN_FFASS_FFASS17_Pos)                               /*!< 0x00020000 */
#define CAN_FFASS_FFASS17                                           CAN_FFASS_FFASS17_Msk                                          /*!<Filter FIFO Assignment bit 17 */
#define CAN_FFASS_FFASS18_Pos                                       (18U)
#define CAN_FFASS_FFASS18_Msk                                       (0x1UL << CAN_FFASS_FFASS18_Pos)                               /*!< 0x00040000 */
#define CAN_FFASS_FFASS18                                           CAN_FFASS_FFASS18_Msk                                          /*!<Filter FIFO Assignment bit 18 */
#define CAN_FFASS_FFASS19_Pos                                       (19U)
#define CAN_FFASS_FFASS19_Msk                                       (0x1UL << CAN_FFASS_FFASS19_Pos)                               /*!< 0x00080000 */
#define CAN_FFASS_FFASS19                                           CAN_FFASS_FFASS19_Msk                                          /*!<Filter FIFO Assignment bit 19 */
#define CAN_FFASS_FFASS20_Pos                                       (20U)
#define CAN_FFASS_FFASS20_Msk                                       (0x1UL << CAN_FFASS_FFASS20_Pos)                               /*!< 0x00100000 */
#define CAN_FFASS_FFASS20                                           CAN_FFASS_FFASS20_Msk                                          /*!<Filter FIFO Assignment bit 20 */
#define CAN_FFASS_FFASS21_Pos                                       (21U)
#define CAN_FFASS_FFASS21_Msk                                       (0x1UL << CAN_FFASS_FFASS21_Pos)                               /*!< 0x00200000 */
#define CAN_FFASS_FFASS21                                           CAN_FFASS_FFASS21_Msk                                          /*!<Filter FIFO Assignment bit 21 */
#define CAN_FFASS_FFASS22_Pos                                       (22U)
#define CAN_FFASS_FFASS22_Msk                                       (0x1UL << CAN_FFASS_FFASS22_Pos)                               /*!< 0x00400000 */
#define CAN_FFASS_FFASS22                                           CAN_FFASS_FFASS22_Msk                                          /*!<Filter FIFO Assignment bit 22 */
#define CAN_FFASS_FFASS23_Pos                                       (23U)
#define CAN_FFASS_FFASS23_Msk                                       (0x1UL << CAN_FFASS_FFASS23_Pos)                               /*!< 0x00800000 */
#define CAN_FFASS_FFASS23                                           CAN_FFASS_FFASS23_Msk                                          /*!<Filter FIFO Assignment bit 23 */
#define CAN_FFASS_FFASS24_Pos                                       (24U)
#define CAN_FFASS_FFASS24_Msk                                       (0x1UL << CAN_FFASS_FFASS24_Pos)                               /*!< 0x01000000 */
#define CAN_FFASS_FFASS24                                           CAN_FFASS_FFASS24_Msk                                          /*!<Filter FIFO Assignment bit 24 */
#define CAN_FFASS_FFASS25_Pos                                       (25U)
#define CAN_FFASS_FFASS25_Msk                                       (0x1UL << CAN_FFASS_FFASS25_Pos)                               /*!< 0x02000000 */
#define CAN_FFASS_FFASS25                                           CAN_FFASS_FFASS25_Msk                                          /*!<Filter FIFO Assignment bit 25 */
#define CAN_FFASS_FFASS26_Pos                                       (26U)
#define CAN_FFASS_FFASS26_Msk                                       (0x1UL << CAN_FFASS_FFASS26_Pos)                               /*!< 0x04000000 */
#define CAN_FFASS_FFASS26                                           CAN_FFASS_FFASS26_Msk                                          /*!<Filter FIFO Assignment bit 26 */
#define CAN_FFASS_FFASS27_Pos                                       (27U)
#define CAN_FFASS_FFASS27_Msk                                       (0x1UL << CAN_FFASS_FFASS27_Pos)                               /*!< 0x08000000 */
#define CAN_FFASS_FFASS27                                           CAN_FFASS_FFASS27_Msk                                          /*!<Filter FIFO Assignment bit 27 */

/*******************  Bit definition for CAN_FACT register  *******************/
#define CAN_FACT_FACT_Pos                                           (0U)
#define CAN_FACT_FACT_Msk                                           (0xFFFFFFFUL << CAN_FACT_FACT_Pos)                             /*!< 0x0FFFFFFF */
#define CAN_FACT_FACT                                               CAN_FACT_FACT_Msk                                              /*!<Filter Active */
#define CAN_FACT_FACT0_Pos                                          (0U)
#define CAN_FACT_FACT0_Msk                                          (0x1UL << CAN_FACT_FACT0_Pos)                                  /*!< 0x00000001 */
#define CAN_FACT_FACT0                                              CAN_FACT_FACT0_Msk                                             /*!<Filter Active bit 0 */
#define CAN_FACT_FACT1_Pos                                          (1U)
#define CAN_FACT_FACT1_Msk                                          (0x1UL << CAN_FACT_FACT1_Pos)                                  /*!< 0x00000002 */
#define CAN_FACT_FACT1                                              CAN_FACT_FACT1_Msk                                             /*!<Filter Active bit 1 */
#define CAN_FACT_FACT2_Pos                                          (2U)
#define CAN_FACT_FACT2_Msk                                          (0x1UL << CAN_FACT_FACT2_Pos)                                  /*!< 0x00000004 */
#define CAN_FACT_FACT2                                              CAN_FACT_FACT2_Msk                                             /*!<Filter Active bit 2 */
#define CAN_FACT_FACT3_Pos                                          (3U)
#define CAN_FACT_FACT3_Msk                                          (0x1UL << CAN_FACT_FACT3_Pos)                                  /*!< 0x00000008 */
#define CAN_FACT_FACT3                                              CAN_FACT_FACT3_Msk                                             /*!<Filter Active bit 3 */
#define CAN_FACT_FACT4_Pos                                          (4U)
#define CAN_FACT_FACT4_Msk                                          (0x1UL << CAN_FACT_FACT4_Pos)                                  /*!< 0x00000010 */
#define CAN_FACT_FACT4                                              CAN_FACT_FACT4_Msk                                             /*!<Filter Active bit 4 */
#define CAN_FACT_FACT5_Pos                                          (5U)
#define CAN_FACT_FACT5_Msk                                          (0x1UL << CAN_FACT_FACT5_Pos)                                  /*!< 0x00000020 */
#define CAN_FACT_FACT5                                              CAN_FACT_FACT5_Msk                                             /*!<Filter Active bit 5 */
#define CAN_FACT_FACT6_Pos                                          (6U)
#define CAN_FACT_FACT6_Msk                                          (0x1UL << CAN_FACT_FACT6_Pos)                                  /*!< 0x00000040 */
#define CAN_FACT_FACT6                                              CAN_FACT_FACT6_Msk                                             /*!<Filter Active bit 6 */
#define CAN_FACT_FACT7_Pos                                          (7U)
#define CAN_FACT_FACT7_Msk                                          (0x1UL << CAN_FACT_FACT7_Pos)                                  /*!< 0x00000080 */
#define CAN_FACT_FACT7                                              CAN_FACT_FACT7_Msk                                             /*!<Filter Active bit 7 */
#define CAN_FACT_FACT8_Pos                                          (8U)
#define CAN_FACT_FACT8_Msk                                          (0x1UL << CAN_FACT_FACT8_Pos)                                  /*!< 0x00000100 */
#define CAN_FACT_FACT8                                              CAN_FACT_FACT8_Msk                                             /*!<Filter Active bit 8 */
#define CAN_FACT_FACT9_Pos                                          (9U)
#define CAN_FACT_FACT9_Msk                                          (0x1UL << CAN_FACT_FACT9_Pos)                                  /*!< 0x00000200 */
#define CAN_FACT_FACT9                                              CAN_FACT_FACT9_Msk                                             /*!<Filter Active bit 9 */
#define CAN_FACT_FACT10_Pos                                         (10U)
#define CAN_FACT_FACT10_Msk                                         (0x1UL << CAN_FACT_FACT10_Pos)                                 /*!< 0x00000400 */
#define CAN_FACT_FACT10                                             CAN_FACT_FACT10_Msk                                            /*!<Filter Active bit 10 */
#define CAN_FACT_FACT11_Pos                                         (11U)
#define CAN_FACT_FACT11_Msk                                         (0x1UL << CAN_FACT_FACT11_Pos)                                 /*!< 0x00000800 */
#define CAN_FACT_FACT11                                             CAN_FACT_FACT11_Msk                                            /*!<Filter Active bit 11 */
#define CAN_FACT_FACT12_Pos                                         (12U)
#define CAN_FACT_FACT12_Msk                                         (0x1UL << CAN_FACT_FACT12_Pos)                                 /*!< 0x00001000 */
#define CAN_FACT_FACT12                                             CAN_FACT_FACT12_Msk                                            /*!<Filter Active bit 12 */
#define CAN_FACT_FACT13_Pos                                         (13U)
#define CAN_FACT_FACT13_Msk                                         (0x1UL << CAN_FACT_FACT13_Pos)                                 /*!< 0x00002000 */
#define CAN_FACT_FACT13                                             CAN_FACT_FACT13_Msk                                            /*!<Filter Active bit 13 */
#define CAN_FACT_FACT14_Pos                                         (14U)
#define CAN_FACT_FACT14_Msk                                         (0x1UL << CAN_FACT_FACT14_Pos)                                 /*!< 0x00004000 */
#define CAN_FACT_FACT14                                             CAN_FACT_FACT14_Msk                                            /*!<Filter Active bit 14 */
#define CAN_FACT_FACT15_Pos                                         (15U)
#define CAN_FACT_FACT15_Msk                                         (0x1UL << CAN_FACT_FACT15_Pos)                                 /*!< 0x00008000 */
#define CAN_FACT_FACT15                                             CAN_FACT_FACT15_Msk                                            /*!<Filter Active bit 15 */
#define CAN_FACT_FACT16_Pos                                         (16U)
#define CAN_FACT_FACT16_Msk                                         (0x1UL << CAN_FACT_FACT16_Pos)                                 /*!< 0x00010000 */
#define CAN_FACT_FACT16                                             CAN_FACT_FACT16_Msk                                            /*!<Filter Active bit 16 */
#define CAN_FACT_FACT17_Pos                                         (17U)
#define CAN_FACT_FACT17_Msk                                         (0x1UL << CAN_FACT_FACT17_Pos)                                 /*!< 0x00020000 */
#define CAN_FACT_FACT17                                             CAN_FACT_FACT17_Msk                                            /*!<Filter Active bit 17 */
#define CAN_FACT_FACT18_Pos                                         (18U)
#define CAN_FACT_FACT18_Msk                                         (0x1UL << CAN_FACT_FACT18_Pos)                                 /*!< 0x00040000 */
#define CAN_FACT_FACT18                                             CAN_FACT_FACT18_Msk                                            /*!<Filter Active bit 18 */
#define CAN_FACT_FACT19_Pos                                         (19U)
#define CAN_FACT_FACT19_Msk                                         (0x1UL << CAN_FACT_FACT19_Pos)                                 /*!< 0x00080000 */
#define CAN_FACT_FACT19                                             CAN_FACT_FACT19_Msk                                            /*!<Filter Active bit 19 */
#define CAN_FACT_FACT20_Pos                                         (20U)
#define CAN_FACT_FACT20_Msk                                         (0x1UL << CAN_FACT_FACT20_Pos)                                 /*!< 0x00100000 */
#define CAN_FACT_FACT20                                             CAN_FACT_FACT20_Msk                                            /*!<Filter Active bit 20 */
#define CAN_FACT_FACT21_Pos                                         (21U)
#define CAN_FACT_FACT21_Msk                                         (0x1UL << CAN_FACT_FACT21_Pos)                                 /*!< 0x00200000 */
#define CAN_FACT_FACT21                                             CAN_FACT_FACT21_Msk                                            /*!<Filter Active bit 21 */
#define CAN_FACT_FACT22_Pos                                         (22U)
#define CAN_FACT_FACT22_Msk                                         (0x1UL << CAN_FACT_FACT22_Pos)                                 /*!< 0x00400000 */
#define CAN_FACT_FACT22                                             CAN_FACT_FACT22_Msk                                            /*!<Filter Active bit 22 */
#define CAN_FACT_FACT23_Pos                                         (23U)
#define CAN_FACT_FACT23_Msk                                         (0x1UL << CAN_FACT_FACT23_Pos)                                 /*!< 0x00800000 */
#define CAN_FACT_FACT23                                             CAN_FACT_FACT23_Msk                                            /*!<Filter Active bit 23 */
#define CAN_FACT_FACT24_Pos                                         (24U)
#define CAN_FACT_FACT24_Msk                                         (0x1UL << CAN_FACT_FACT24_Pos)                                 /*!< 0x01000000 */
#define CAN_FACT_FACT24                                             CAN_FACT_FACT24_Msk                                            /*!<Filter Active bit 24 */
#define CAN_FACT_FACT25_Pos                                         (25U)
#define CAN_FACT_FACT25_Msk                                         (0x1UL << CAN_FACT_FACT25_Pos)                                 /*!< 0x02000000 */
#define CAN_FACT_FACT25                                             CAN_FACT_FACT25_Msk                                            /*!<Filter Active bit 25 */
#define CAN_FACT_FACT26_Pos                                         (26U)
#define CAN_FACT_FACT26_Msk                                         (0x1UL << CAN_FACT_FACT26_Pos)                                 /*!< 0x04000000 */
#define CAN_FACT_FACT26                                             CAN_FACT_FACT26_Msk                                            /*!<Filter Active bit 26 */
#define CAN_FACT_FACT27_Pos                                         (27U)
#define CAN_FACT_FACT27_Msk                                         (0x1UL << CAN_FACT_FACT27_Pos)                                 /*!< 0x08000000 */
#define CAN_FACT_FACT27                                             CAN_FACT_FACT27_Msk                                            /*!<Filter Active bit 27 */


