LuckkMaker/betaflight/lib/main/APM32F4/Libraries/Device/Geehy/APM32F4xx/Include/apm32f423xx.h
/********************  Bits definition for DMA_HIFCLR  register  ****************/
#define DMA_HIFCLR_CTXCIFLG7_Pos                                    (27U)
#define DMA_HIFCLR_CTXCIFLG7_Msk                                    (0x1UL << DMA_HIFCLR_CTXCIFLG7_Pos)                            /*!< 0x08000000 */
#define DMA_HIFCLR_CTXCIFLG7                                        DMA_HIFCLR_CTXCIFLG7_Msk
#define DMA_HIFCLR_CHTXIFLG7_Pos                                    (26U)
#define DMA_HIFCLR_CHTXIFLG7_Msk                                    (0x1UL << DMA_HIFCLR_CHTXIFLG7_Pos)                            /*!< 0x04000000 */
#define DMA_HIFCLR_CHTXIFLG7                                        DMA_HIFCLR_CHTXIFLG7_Msk
#define DMA_HIFCLR_CTXEIFLG7_Pos                                    (25U)
#define DMA_HIFCLR_CTXEIFLG7_Msk                                    (0x1UL << DMA_HIFCLR_CTXEIFLG7_Pos)                            /*!< 0x02000000 */
#define DMA_HIFCLR_CTXEIFLG7                                        DMA_HIFCLR_CTXEIFLG7_Msk
#define DMA_HIFCLR_CDMEIFLG7_Pos                                    (24U)
#define DMA_HIFCLR_CDMEIFLG7_Msk                                    (0x1UL << DMA_HIFCLR_CDMEIFLG7_Pos)                            /*!< 0x01000000 */
#define DMA_HIFCLR_CDMEIFLG7                                        DMA_HIFCLR_CDMEIFLG7_Msk
#define DMA_HIFCLR_CFEIFLG7_Pos                                     (22U)
#define DMA_HIFCLR_CFEIFLG7_Msk                                     (0x1UL << DMA_HIFCLR_CFEIFLG7_Pos)                             /*!< 0x00400000 */
#define DMA_HIFCLR_CFEIFLG7                                         DMA_HIFCLR_CFEIFLG7_Msk
#define DMA_HIFCLR_CTXCIFLG6_Pos                                    (21U)
#define DMA_HIFCLR_CTXCIFLG6_Msk                                    (0x1UL << DMA_HIFCLR_CTXCIFLG6_Pos)                            /*!< 0x00200000 */
#define DMA_HIFCLR_CTXCIFLG6                                        DMA_HIFCLR_CTXCIFLG6_Msk
#define DMA_HIFCLR_CHTXIFLG6_Pos                                    (20U)
#define DMA_HIFCLR_CHTXIFLG6_Msk                                    (0x1UL << DMA_HIFCLR_CHTXIFLG6_Pos)                            /*!< 0x00100000 */
#define DMA_HIFCLR_CHTXIFLG6                                        DMA_HIFCLR_CHTXIFLG6_Msk
#define DMA_HIFCLR_CTXEIFLG6_Pos                                    (19U)
#define DMA_HIFCLR_CTXEIFLG6_Msk                                    (0x1UL << DMA_HIFCLR_CTXEIFLG6_Pos)                            /*!< 0x00080000 */
#define DMA_HIFCLR_CTXEIFLG6                                        DMA_HIFCLR_CTXEIFLG6_Msk
#define DMA_HIFCLR_CDMEIFLG6_Pos                                    (18U)
#define DMA_HIFCLR_CDMEIFLG6_Msk                                    (0x1UL << DMA_HIFCLR_CDMEIFLG6_Pos)                            /*!< 0x00040000 */
#define DMA_HIFCLR_CDMEIFLG6                                        DMA_HIFCLR_CDMEIFLG6_Msk
#define DMA_HIFCLR_CFEIFLG6_Pos                                     (16U)
#define DMA_HIFCLR_CFEIFLG6_Msk                                     (0x1UL << DMA_HIFCLR_CFEIFLG6_Pos)                             /*!< 0x00010000 */
#define DMA_HIFCLR_CFEIFLG6                                         DMA_HIFCLR_CFEIFLG6_Msk
#define DMA_HIFCLR_CTXCIFLG5_Pos                                    (11U)
#define DMA_HIFCLR_CTXCIFLG5_Msk                                    (0x1UL << DMA_HIFCLR_CTXCIFLG5_Pos)                            /*!< 0x00000800 */
#define DMA_HIFCLR_CTXCIFLG5                                        DMA_HIFCLR_CTXCIFLG5_Msk
#define DMA_HIFCLR_CHTXIFLG5_Pos                                    (10U)
#define DMA_HIFCLR_CHTXIFLG5_Msk                                    (0x1UL << DMA_HIFCLR_CHTXIFLG5_Pos)                            /*!< 0x00000400 */
#define DMA_HIFCLR_CHTXIFLG5                                        DMA_HIFCLR_CHTXIFLG5_Msk
#define DMA_HIFCLR_CTXEIFLG5_Pos                                    (9U)
#define DMA_HIFCLR_CTXEIFLG5_Msk                                    (0x1UL << DMA_HIFCLR_CTXEIFLG5_Pos)                            /*!< 0x00000200 */
#define DMA_HIFCLR_CTXEIFLG5                                        DMA_HIFCLR_CTXEIFLG5_Msk
#define DMA_HIFCLR_CDMEIFLG5_Pos                                    (8U)
#define DMA_HIFCLR_CDMEIFLG5_Msk                                    (0x1UL << DMA_HIFCLR_CDMEIFLG5_Pos)                            /*!< 0x00000100 */
#define DMA_HIFCLR_CDMEIFLG5                                        DMA_HIFCLR_CDMEIFLG5_Msk
#define DMA_HIFCLR_CFEIFLG5_Pos                                     (6U)
#define DMA_HIFCLR_CFEIFLG5_Msk                                     (0x1UL << DMA_HIFCLR_CFEIFLG5_Pos)                             /*!< 0x00000040 */
#define DMA_HIFCLR_CFEIFLG5                                         DMA_HIFCLR_CFEIFLG5_Msk
#define DMA_HIFCLR_CTXCIFLG4_Pos                                    (5U)
#define DMA_HIFCLR_CTXCIFLG4_Msk                                    (0x1UL << DMA_HIFCLR_CTXCIFLG4_Pos)                            /*!< 0x00000020 */
#define DMA_HIFCLR_CTXCIFLG4                                        DMA_HIFCLR_CTXCIFLG4_Msk
#define DMA_HIFCLR_CHTXIFLG4_Pos                                    (4U)
#define DMA_HIFCLR_CHTXIFLG4_Msk                                    (0x1UL << DMA_HIFCLR_CHTXIFLG4_Pos)                            /*!< 0x00000010 */
#define DMA_HIFCLR_CHTXIFLG4                                        DMA_HIFCLR_CHTXIFLG4_Msk
#define DMA_HIFCLR_CTXEIFLG4_Pos                                    (3U)
#define DMA_HIFCLR_CTXEIFLG4_Msk                                    (0x1UL << DMA_HIFCLR_CTXEIFLG4_Pos)                            /*!< 0x00000008 */
#define DMA_HIFCLR_CTXEIFLG4                                        DMA_HIFCLR_CTXEIFLG4_Msk
#define DMA_HIFCLR_CDMEIFLG4_Pos                                    (2U)
#define DMA_HIFCLR_CDMEIFLG4_Msk                                    (0x1UL << DMA_HIFCLR_CDMEIFLG4_Pos)                            /*!< 0x00000004 */
#define DMA_HIFCLR_CDMEIFLG4                                        DMA_HIFCLR_CDMEIFLG4_Msk
#define DMA_HIFCLR_CFEIFLG4_Pos                                     (0U)
#define DMA_HIFCLR_CFEIFLG4_Msk                                     (0x1UL << DMA_HIFCLR_CFEIFLG4_Pos)                             /*!< 0x00000001 */
#define DMA_HIFCLR_CFEIFLG4                                         DMA_HIFCLR_CFEIFLG4_Msk

/******************  Bit definition for DMA_SxPAR register  ********************/
#define DMA_PADDRx_PADDR_Pos                                        (0U)
#define DMA_PADDRx_PADDR_Msk                                        (0xFFFFFFFFUL << DMA_PADDRx_PADDR_Pos)                         /*!< 0xFFFFFFFF */
#define DMA_PADDRx_PADDR                                            DMA_PADDRx_PADDR_Msk                                           /*!< Peripheral Address */

/******************  Bit definition for DMA_SxM0AR register  ********************/
#define DMA_M0ADDRx_M0ADDR_Pos                                      (0U)
#define DMA_M0ADDRx_M0ADDR_Msk                                      (0xFFFFFFFFUL << DMA_M0ADDRx_M0ADDR_Pos)                       /*!< 0xFFFFFFFF */
#define DMA_M0ADDRx_M0ADDR                                          DMA_M0ADDRx_M0ADDR_Msk                                         /*!< Memory Address */

/******************  Bit definition for DMA_SxM1AR register  ********************/
#define DMA_M1ADDRx_M1ADDR_Pos                                      (0U)
#define DMA_M1ADDRx_M1ADDR_Msk                                      (0xFFFFFFFFUL << DMA_M1ADDRx_M1ADDR_Pos)                       /*!< 0xFFFFFFFF */
#define DMA_M1ADDRx_M1ADDR                                          DMA_M1ADDRx_M1ADDR_Msk                                         /*!< Memory Address */


/******************************************************************************/
/*                                                                            */
/*                    External Interrupt/Event Controller                     */
/*                                                                            */
/******************************************************************************/
/*******************  Bit definition for EINT_IMASK register  *******************/
#define EINT_IMASK_IMASK0_Pos                                       (0U)
#define EINT_IMASK_IMASK0_Msk                                       (0x1UL << EINT_IMASK_IMASK0_Pos)                               /*!< 0x00000001 */
#define EINT_IMASK_IMASK0                                           EINT_IMASK_IMASK0_Msk                                          /*!< Interrupt Mask on line 0 */
#define EINT_IMASK_IMASK1_Pos                                       (1U)
#define EINT_IMASK_IMASK1_Msk                                       (0x1UL << EINT_IMASK_IMASK1_Pos)                               /*!< 0x00000002 */
#define EINT_IMASK_IMASK1                                           EINT_IMASK_IMASK1_Msk                                          /*!< Interrupt Mask on line 1 */
#define EINT_IMASK_IMASK2_Pos                                       (2U)
#define EINT_IMASK_IMASK2_Msk                                       (0x1UL << EINT_IMASK_IMASK2_Pos)                               /*!< 0x00000004 */
#define EINT_IMASK_IMASK2                                           EINT_IMASK_IMASK2_Msk                                          /*!< Interrupt Mask on line 2 */
#define EINT_IMASK_IMASK3_Pos                                       (3U)
#define EINT_IMASK_IMASK3_Msk                                       (0x1UL << EINT_IMASK_IMASK3_Pos)                               /*!< 0x00000008 */
#define EINT_IMASK_IMASK3                                           EINT_IMASK_IMASK3_Msk                                          /*!< Interrupt Mask on line 3 */
#define EINT_IMASK_IMASK4_Pos                                       (4U)
#define EINT_IMASK_IMASK4_Msk                                       (0x1UL << EINT_IMASK_IMASK4_Pos)                               /*!< 0x00000010 */
#define EINT_IMASK_IMASK4                                           EINT_IMASK_IMASK4_Msk                                          /*!< Interrupt Mask on line 4 */
#define EINT_IMASK_IMASK5_Pos                                       (5U)
#define EINT_IMASK_IMASK5_Msk                                       (0x1UL << EINT_IMASK_IMASK5_Pos)                               /*!< 0x00000020 */
#define EINT_IMASK_IMASK5                                           EINT_IMASK_IMASK5_Msk                                          /*!< Interrupt Mask on line 5 */
#define EINT_IMASK_IMASK6_Pos                                       (6U)
#define EINT_IMASK_IMASK6_Msk                                       (0x1UL << EINT_IMASK_IMASK6_Pos)                               /*!< 0x00000040 */
#define EINT_IMASK_IMASK6                                           EINT_IMASK_IMASK6_Msk                                          /*!< Interrupt Mask on line 6 */
#define EINT_IMASK_IMASK7_Pos                                       (7U)
#define EINT_IMASK_IMASK7_Msk                                       (0x1UL << EINT_IMASK_IMASK7_Pos)                               /*!< 0x00000080 */
#define EINT_IMASK_IMASK7                                           EINT_IMASK_IMASK7_Msk                                          /*!< Interrupt Mask on line 7 */
#define EINT_IMASK_IMASK8_Pos                                       (8U)
#define EINT_IMASK_IMASK8_Msk                                       (0x1UL << EINT_IMASK_IMASK8_Pos)                               /*!< 0x00000100 */
#define EINT_IMASK_IMASK8                                           EINT_IMASK_IMASK8_Msk                                          /*!< Interrupt Mask on line 8 */
#define EINT_IMASK_IMASK9_Pos                                       (9U)
#define EINT_IMASK_IMASK9_Msk                                       (0x1UL << EINT_IMASK_IMASK9_Pos)                               /*!< 0x00000200 */
#define EINT_IMASK_IMASK9                                           EINT_IMASK_IMASK9_Msk                                          /*!< Interrupt Mask on line 9 */
#define EINT_IMASK_IMASK10_Pos                                      (10U)
#define EINT_IMASK_IMASK10_Msk                                      (0x1UL << EINT_IMASK_IMASK10_Pos)                              /*!< 0x00000400 */
#define EINT_IMASK_IMASK10                                          EINT_IMASK_IMASK10_Msk                                         /*!< Interrupt Mask on line 10 */
#define EINT_IMASK_IMASK11_Pos                                      (11U)
#define EINT_IMASK_IMASK11_Msk                                      (0x1UL << EINT_IMASK_IMASK11_Pos)                              /*!< 0x00000800 */
#define EINT_IMASK_IMASK11                                          EINT_IMASK_IMASK11_Msk                                         /*!< Interrupt Mask on line 11 */
#define EINT_IMASK_IMASK12_Pos                                      (12U)
#define EINT_IMASK_IMASK12_Msk                                      (0x1UL << EINT_IMASK_IMASK12_Pos)                              /*!< 0x00001000 */
#define EINT_IMASK_IMASK12                                          EINT_IMASK_IMASK12_Msk                                         /*!< Interrupt Mask on line 12 */
#define EINT_IMASK_IMASK13_Pos                                      (13U)
#define EINT_IMASK_IMASK13_Msk                                      (0x1UL << EINT_IMASK_IMASK13_Pos)                              /*!< 0x00002000 */
#define EINT_IMASK_IMASK13                                          EINT_IMASK_IMASK13_Msk                                         /*!< Interrupt Mask on line 13 */
#define EINT_IMASK_IMASK14_Pos                                      (14U)
#define EINT_IMASK_IMASK14_Msk                                      (0x1UL << EINT_IMASK_IMASK14_Pos)                              /*!< 0x00004000 */
#define EINT_IMASK_IMASK14                                          EINT_IMASK_IMASK14_Msk                                         /*!< Interrupt Mask on line 14 */
#define EINT_IMASK_IMASK15_Pos                                      (15U)
#define EINT_IMASK_IMASK15_Msk                                      (0x1UL << EINT_IMASK_IMASK15_Pos)                              /*!< 0x00008000 */
#define EINT_IMASK_IMASK15                                          EINT_IMASK_IMASK15_Msk                                         /*!< Interrupt Mask on line 15 */
#define EINT_IMASK_IMASK16_Pos                                      (16U)
#define EINT_IMASK_IMASK16_Msk                                      (0x1UL << EINT_IMASK_IMASK16_Pos)                              /*!< 0x00010000 */
#define EINT_IMASK_IMASK16                                          EINT_IMASK_IMASK16_Msk                                         /*!< Interrupt Mask on line 16 */
#define EINT_IMASK_IMASK17_Pos                                      (17U)
#define EINT_IMASK_IMASK17_Msk                                      (0x1UL << EINT_IMASK_IMASK17_Pos)                              /*!< 0x00020000 */
#define EINT_IMASK_IMASK17                                          EINT_IMASK_IMASK17_Msk                                         /*!< Interrupt Mask on line 17 */
#define EINT_IMASK_IMASK18_Pos                                      (18U)
#define EINT_IMASK_IMASK18_Msk                                      (0x1UL << EINT_IMASK_IMASK18_Pos)                              /*!< 0x00040000 */
#define EINT_IMASK_IMASK18                                          EINT_IMASK_IMASK18_Msk                                         /*!< Interrupt Mask on line 18 */
#define EINT_IMASK_IMASK19_Pos                                      (19U)
#define EINT_IMASK_IMASK19_Msk                                      (0x1UL << EINT_IMASK_IMASK19_Pos)                              /*!< 0x00080000 */
#define EINT_IMASK_IMASK19                                          EINT_IMASK_IMASK19_Msk                                         /*!< Interrupt Mask on line 19 */
#define EINT_IMASK_IMASK20_Pos                                      (20U)
#define EINT_IMASK_IMASK20_Msk                                      (0x1UL << EINT_IMASK_IMASK20_Pos)                              /*!< 0x00100000 */
#define EINT_IMASK_IMASK20                                          EINT_IMASK_IMASK20_Msk                                         /*!< Interrupt Mask on line 20 */
#define EINT_IMASK_IMASK21_Pos                                      (21U)
#define EINT_IMASK_IMASK21_Msk                                      (0x1UL << EINT_IMASK_IMASK21_Pos)                              /*!< 0x00200000 */
#define EINT_IMASK_IMASK21                                          EINT_IMASK_IMASK21_Msk                                         /*!< Interrupt Mask on line 21 */
#define EINT_IMASK_IMASK22_Pos                                      (22U)
#define EINT_IMASK_IMASK22_Msk                                      (0x1UL << EINT_IMASK_IMASK22_Pos)                              /*!< 0x00400000 */
#define EINT_IMASK_IMASK22                                          EINT_IMASK_IMASK22_Msk                                         /*!< Interrupt Mask on line 22 */

/* Reference Defines */
#define EINT_IMASK_IM0                                              EINT_IMASK_IMASK0
#define EINT_IMASK_IM1                                              EINT_IMASK_IMASK1
#define EINT_IMASK_IM2                                              EINT_IMASK_IMASK2
#define EINT_IMASK_IM3                                              EINT_IMASK_IMASK3
#define EINT_IMASK_IM4                                              EINT_IMASK_IMASK4
#define EINT_IMASK_IM5                                              EINT_IMASK_IMASK5
#define EINT_IMASK_IM6                                              EINT_IMASK_IMASK6
#define EINT_IMASK_IM7                                              EINT_IMASK_IMASK7
#define EINT_IMASK_IM8                                              EINT_IMASK_IMASK8
#define EINT_IMASK_IM9                                              EINT_IMASK_IMASK9
#define EINT_IMASK_IM10                                             EINT_IMASK_IMASK10
#define EINT_IMASK_IM11                                             EINT_IMASK_IMASK11
#define EINT_IMASK_IM12                                             EINT_IMASK_IMASK12
#define EINT_IMASK_IM13                                             EINT_IMASK_IMASK13
#define EINT_IMASK_IM14                                             EINT_IMASK_IMASK14
#define EINT_IMASK_IM15                                             EINT_IMASK_IMASK15
#define EINT_IMASK_IM16                                             EINT_IMASK_IMASK16
#define EINT_IMASK_IM17                                             EINT_IMASK_IMASK17
#define EINT_IMASK_IM18                                             EINT_IMASK_IMASK18
#define EINT_IMASK_IM19                                             EINT_IMASK_IMASK19
#define EINT_IMASK_IM20                                             EINT_IMASK_IMASK20
#define EINT_IMASK_IM21                                             EINT_IMASK_IMASK21
#define EINT_IMASK_IM22                                             EINT_IMASK_IMASK22
#define EINT_IMASK_IM_Pos                                           (0U)
#define EINT_IMASK_IM_Msk                                           (0x7FFFFFUL << EINT_IMASK_IM_Pos)                              /*!< 0x007FFFFF */
#define EINT_IMASK_IM                                               EINT_IMASK_IM_Msk                                              /*!< Interrupt Mask All */

