LuckkMaker/betaflight/lib/main/APM32F4/Libraries/Device/Geehy/APM32F4xx/Include/apm32f423xx.h
/* Legacy defines */
#define GPIO_OMODE_OT_0                                             GPIO_OMODE_OMODE0
#define GPIO_OMODE_OT_1                                             GPIO_OMODE_OMODE1
#define GPIO_OMODE_OT_2                                             GPIO_OMODE_OMODE2
#define GPIO_OMODE_OT_3                                             GPIO_OMODE_OMODE3
#define GPIO_OMODE_OT_4                                             GPIO_OMODE_OMODE4
#define GPIO_OMODE_OT_5                                             GPIO_OMODE_OMODE5
#define GPIO_OMODE_OT_6                                             GPIO_OMODE_OMODE6
#define GPIO_OMODE_OT_7                                             GPIO_OMODE_OMODE7
#define GPIO_OMODE_OT_8                                             GPIO_OMODE_OMODE8
#define GPIO_OMODE_OT_9                                             GPIO_OMODE_OMODE9
#define GPIO_OMODE_OT_10                                            GPIO_OMODE_OMODE10
#define GPIO_OMODE_OT_11                                            GPIO_OMODE_OMODE11
#define GPIO_OMODE_OT_12                                            GPIO_OMODE_OMODE12
#define GPIO_OMODE_OT_13                                            GPIO_OMODE_OMODE13
#define GPIO_OMODE_OT_14                                            GPIO_OMODE_OMODE14
#define GPIO_OMODE_OT_15                                            GPIO_OMODE_OMODE15

/******************  Bits definition for GPIO_OSSEL register  ***************/
#define GPIO_OSSEL_OSSEL0_Pos                                       (0U)
#define GPIO_OSSEL_OSSEL0_Msk                                       (0x3UL << GPIO_OSSEL_OSSEL0_Pos)                               /*!< 0x00000003 */
#define GPIO_OSSEL_OSSEL0                                           GPIO_OSSEL_OSSEL0_Msk
#define GPIO_OSSEL_OSSEL0_0                                         (0x1UL << GPIO_OSSEL_OSSEL0_Pos)                               /*!< 0x00000001 */
#define GPIO_OSSEL_OSSEL0_1                                         (0x2UL << GPIO_OSSEL_OSSEL0_Pos)                               /*!< 0x00000002 */
#define GPIO_OSSEL_OSSEL1_Pos                                       (2U)
#define GPIO_OSSEL_OSSEL1_Msk                                       (0x3UL << GPIO_OSSEL_OSSEL1_Pos)                               /*!< 0x0000000C */
#define GPIO_OSSEL_OSSEL1                                           GPIO_OSSEL_OSSEL1_Msk
#define GPIO_OSSEL_OSSEL1_0                                         (0x1UL << GPIO_OSSEL_OSSEL1_Pos)                               /*!< 0x00000004 */
#define GPIO_OSSEL_OSSEL1_1                                         (0x2UL << GPIO_OSSEL_OSSEL1_Pos)                               /*!< 0x00000008 */
#define GPIO_OSSEL_OSSEL2_Pos                                       (4U)
#define GPIO_OSSEL_OSSEL2_Msk                                       (0x3UL << GPIO_OSSEL_OSSEL2_Pos)                               /*!< 0x00000030 */
#define GPIO_OSSEL_OSSEL2                                           GPIO_OSSEL_OSSEL2_Msk
#define GPIO_OSSEL_OSSEL2_0                                         (0x1UL << GPIO_OSSEL_OSSEL2_Pos)                               /*!< 0x00000010 */
#define GPIO_OSSEL_OSSEL2_1                                         (0x2UL << GPIO_OSSEL_OSSEL2_Pos)                               /*!< 0x00000020 */
#define GPIO_OSSEL_OSSEL3_Pos                                       (6U)
#define GPIO_OSSEL_OSSEL3_Msk                                       (0x3UL << GPIO_OSSEL_OSSEL3_Pos)                               /*!< 0x000000C0 */
#define GPIO_OSSEL_OSSEL3                                           GPIO_OSSEL_OSSEL3_Msk
#define GPIO_OSSEL_OSSEL3_0                                         (0x1UL << GPIO_OSSEL_OSSEL3_Pos)                               /*!< 0x00000040 */
#define GPIO_OSSEL_OSSEL3_1                                         (0x2UL << GPIO_OSSEL_OSSEL3_Pos)                               /*!< 0x00000080 */
#define GPIO_OSSEL_OSSEL4_Pos                                       (8U)
#define GPIO_OSSEL_OSSEL4_Msk                                       (0x3UL << GPIO_OSSEL_OSSEL4_Pos)                               /*!< 0x00000300 */
#define GPIO_OSSEL_OSSEL4                                           GPIO_OSSEL_OSSEL4_Msk
#define GPIO_OSSEL_OSSEL4_0                                         (0x1UL << GPIO_OSSEL_OSSEL4_Pos)                               /*!< 0x00000100 */
#define GPIO_OSSEL_OSSEL4_1                                         (0x2UL << GPIO_OSSEL_OSSEL4_Pos)                               /*!< 0x00000200 */
#define GPIO_OSSEL_OSSEL5_Pos                                       (10U)
#define GPIO_OSSEL_OSSEL5_Msk                                       (0x3UL << GPIO_OSSEL_OSSEL5_Pos)                               /*!< 0x00000C00 */
#define GPIO_OSSEL_OSSEL5                                           GPIO_OSSEL_OSSEL5_Msk
#define GPIO_OSSEL_OSSEL5_0                                         (0x1UL << GPIO_OSSEL_OSSEL5_Pos)                               /*!< 0x00000400 */
#define GPIO_OSSEL_OSSEL5_1                                         (0x2UL << GPIO_OSSEL_OSSEL5_Pos)                               /*!< 0x00000800 */
#define GPIO_OSSEL_OSSEL6_Pos                                       (12U)
#define GPIO_OSSEL_OSSEL6_Msk                                       (0x3UL << GPIO_OSSEL_OSSEL6_Pos)                               /*!< 0x00003000 */
#define GPIO_OSSEL_OSSEL6                                           GPIO_OSSEL_OSSEL6_Msk
#define GPIO_OSSEL_OSSEL6_0                                         (0x1UL << GPIO_OSSEL_OSSEL6_Pos)                               /*!< 0x00001000 */
#define GPIO_OSSEL_OSSEL6_1                                         (0x2UL << GPIO_OSSEL_OSSEL6_Pos)                               /*!< 0x00002000 */
#define GPIO_OSSEL_OSSEL7_Pos                                       (14U)
#define GPIO_OSSEL_OSSEL7_Msk                                       (0x3UL << GPIO_OSSEL_OSSEL7_Pos)                               /*!< 0x0000C000 */
#define GPIO_OSSEL_OSSEL7                                           GPIO_OSSEL_OSSEL7_Msk
#define GPIO_OSSEL_OSSEL7_0                                         (0x1UL << GPIO_OSSEL_OSSEL7_Pos)                               /*!< 0x00004000 */
#define GPIO_OSSEL_OSSEL7_1                                         (0x2UL << GPIO_OSSEL_OSSEL7_Pos)                               /*!< 0x00008000 */
#define GPIO_OSSEL_OSSEL8_Pos                                       (16U)
#define GPIO_OSSEL_OSSEL8_Msk                                       (0x3UL << GPIO_OSSEL_OSSEL8_Pos)                               /*!< 0x00030000 */
#define GPIO_OSSEL_OSSEL8                                           GPIO_OSSEL_OSSEL8_Msk
#define GPIO_OSSEL_OSSEL8_0                                         (0x1UL << GPIO_OSSEL_OSSEL8_Pos)                               /*!< 0x00010000 */
#define GPIO_OSSEL_OSSEL8_1                                         (0x2UL << GPIO_OSSEL_OSSEL8_Pos)                               /*!< 0x00020000 */
#define GPIO_OSSEL_OSSEL9_Pos                                       (18U)
#define GPIO_OSSEL_OSSEL9_Msk                                       (0x3UL << GPIO_OSSEL_OSSEL9_Pos)                               /*!< 0x000C0000 */
#define GPIO_OSSEL_OSSEL9                                           GPIO_OSSEL_OSSEL9_Msk
#define GPIO_OSSEL_OSSEL9_0                                         (0x1UL << GPIO_OSSEL_OSSEL9_Pos)                               /*!< 0x00040000 */
#define GPIO_OSSEL_OSSEL9_1                                         (0x2UL << GPIO_OSSEL_OSSEL9_Pos)                               /*!< 0x00080000 */
#define GPIO_OSSEL_OSSEL10_Pos                                      (20U)
#define GPIO_OSSEL_OSSEL10_Msk                                      (0x3UL << GPIO_OSSEL_OSSEL10_Pos)                              /*!< 0x00300000 */
#define GPIO_OSSEL_OSSEL10                                          GPIO_OSSEL_OSSEL10_Msk
#define GPIO_OSSEL_OSSEL10_0                                        (0x1UL << GPIO_OSSEL_OSSEL10_Pos)                              /*!< 0x00100000 */
#define GPIO_OSSEL_OSSEL10_1                                        (0x2UL << GPIO_OSSEL_OSSEL10_Pos)                              /*!< 0x00200000 */
#define GPIO_OSSEL_OSSEL11_Pos                                      (22U)
#define GPIO_OSSEL_OSSEL11_Msk                                      (0x3UL << GPIO_OSSEL_OSSEL11_Pos)                              /*!< 0x00C00000 */
#define GPIO_OSSEL_OSSEL11                                          GPIO_OSSEL_OSSEL11_Msk
#define GPIO_OSSEL_OSSEL11_0                                        (0x1UL << GPIO_OSSEL_OSSEL11_Pos)                              /*!< 0x00400000 */
#define GPIO_OSSEL_OSSEL11_1                                        (0x2UL << GPIO_OSSEL_OSSEL11_Pos)                              /*!< 0x00800000 */
#define GPIO_OSSEL_OSSEL12_Pos                                      (24U)
#define GPIO_OSSEL_OSSEL12_Msk                                      (0x3UL << GPIO_OSSEL_OSSEL12_Pos)                              /*!< 0x03000000 */
#define GPIO_OSSEL_OSSEL12                                          GPIO_OSSEL_OSSEL12_Msk
#define GPIO_OSSEL_OSSEL12_0                                        (0x1UL << GPIO_OSSEL_OSSEL12_Pos)                              /*!< 0x01000000 */
#define GPIO_OSSEL_OSSEL12_1                                        (0x2UL << GPIO_OSSEL_OSSEL12_Pos)                              /*!< 0x02000000 */
#define GPIO_OSSEL_OSSEL13_Pos                                      (26U)
#define GPIO_OSSEL_OSSEL13_Msk                                      (0x3UL << GPIO_OSSEL_OSSEL13_Pos)                              /*!< 0x0C000000 */
#define GPIO_OSSEL_OSSEL13                                          GPIO_OSSEL_OSSEL13_Msk
#define GPIO_OSSEL_OSSEL13_0                                        (0x1UL << GPIO_OSSEL_OSSEL13_Pos)                              /*!< 0x04000000 */
#define GPIO_OSSEL_OSSEL13_1                                        (0x2UL << GPIO_OSSEL_OSSEL13_Pos)                              /*!< 0x08000000 */
#define GPIO_OSSEL_OSSEL14_Pos                                      (28U)
#define GPIO_OSSEL_OSSEL14_Msk                                      (0x3UL << GPIO_OSSEL_OSSEL14_Pos)                              /*!< 0x30000000 */
#define GPIO_OSSEL_OSSEL14                                          GPIO_OSSEL_OSSEL14_Msk
#define GPIO_OSSEL_OSSEL14_0                                        (0x1UL << GPIO_OSSEL_OSSEL14_Pos)                              /*!< 0x10000000 */
#define GPIO_OSSEL_OSSEL14_1                                        (0x2UL << GPIO_OSSEL_OSSEL14_Pos)                              /*!< 0x20000000 */
#define GPIO_OSSEL_OSSEL15_Pos                                      (30U)
#define GPIO_OSSEL_OSSEL15_Msk                                      (0x3UL << GPIO_OSSEL_OSSEL15_Pos)                              /*!< 0xC0000000 */
#define GPIO_OSSEL_OSSEL15                                          GPIO_OSSEL_OSSEL15_Msk
#define GPIO_OSSEL_OSSEL15_0                                        (0x1UL << GPIO_OSSEL_OSSEL15_Pos)                              /*!< 0x40000000 */
#define GPIO_OSSEL_OSSEL15_1                                        (0x2UL << GPIO_OSSEL_OSSEL15_Pos)                              /*!< 0x80000000 */

