LuckkMaker/betaflight/lib/main/APM32F4/Libraries/Device/Geehy/APM32F4xx/Include/apm32f423xx.h
/* Legacy defines */
#define GPIO_OSPEEDER_OSPEEDR0                                      GPIO_OSSEL_OSSEL0
#define GPIO_OSPEEDER_OSPEEDR0_0                                    GPIO_OSSEL_OSSEL0_0
#define GPIO_OSPEEDER_OSPEEDR0_1                                    GPIO_OSSEL_OSSEL0_1
#define GPIO_OSPEEDER_OSPEEDR1                                      GPIO_OSSEL_OSSEL1
#define GPIO_OSPEEDER_OSPEEDR1_0                                    GPIO_OSSEL_OSSEL1_0
#define GPIO_OSPEEDER_OSPEEDR1_1                                    GPIO_OSSEL_OSSEL1_1
#define GPIO_OSPEEDER_OSPEEDR2                                      GPIO_OSSEL_OSSEL2
#define GPIO_OSPEEDER_OSPEEDR2_0                                    GPIO_OSSEL_OSSEL2_0
#define GPIO_OSPEEDER_OSPEEDR2_1                                    GPIO_OSSEL_OSSEL2_1
#define GPIO_OSPEEDER_OSPEEDR3                                      GPIO_OSSEL_OSSEL3
#define GPIO_OSPEEDER_OSPEEDR3_0                                    GPIO_OSSEL_OSSEL3_0
#define GPIO_OSPEEDER_OSPEEDR3_1                                    GPIO_OSSEL_OSSEL3_1
#define GPIO_OSPEEDER_OSPEEDR4                                      GPIO_OSSEL_OSSEL4
#define GPIO_OSPEEDER_OSPEEDR4_0                                    GPIO_OSSEL_OSSEL4_0
#define GPIO_OSPEEDER_OSPEEDR4_1                                    GPIO_OSSEL_OSSEL4_1
#define GPIO_OSPEEDER_OSPEEDR5                                      GPIO_OSSEL_OSSEL5
#define GPIO_OSPEEDER_OSPEEDR5_0                                    GPIO_OSSEL_OSSEL5_0
#define GPIO_OSPEEDER_OSPEEDR5_1                                    GPIO_OSSEL_OSSEL5_1
#define GPIO_OSPEEDER_OSPEEDR6                                      GPIO_OSSEL_OSSEL6
#define GPIO_OSPEEDER_OSPEEDR6_0                                    GPIO_OSSEL_OSSEL6_0
#define GPIO_OSPEEDER_OSPEEDR6_1                                    GPIO_OSSEL_OSSEL6_1
#define GPIO_OSPEEDER_OSPEEDR7                                      GPIO_OSSEL_OSSEL7
#define GPIO_OSPEEDER_OSPEEDR7_0                                    GPIO_OSSEL_OSSEL7_0
#define GPIO_OSPEEDER_OSPEEDR7_1                                    GPIO_OSSEL_OSSEL7_1
#define GPIO_OSPEEDER_OSPEEDR8                                      GPIO_OSSEL_OSSEL8
#define GPIO_OSPEEDER_OSPEEDR8_0                                    GPIO_OSSEL_OSSEL8_0
#define GPIO_OSPEEDER_OSPEEDR8_1                                    GPIO_OSSEL_OSSEL8_1
#define GPIO_OSPEEDER_OSPEEDR9                                      GPIO_OSSEL_OSSEL9
#define GPIO_OSPEEDER_OSPEEDR9_0                                    GPIO_OSSEL_OSSEL9_0
#define GPIO_OSPEEDER_OSPEEDR9_1                                    GPIO_OSSEL_OSSEL9_1
#define GPIO_OSPEEDER_OSPEEDR10                                     GPIO_OSSEL_OSSEL10
#define GPIO_OSPEEDER_OSPEEDR10_0                                   GPIO_OSSEL_OSSEL10_0
#define GPIO_OSPEEDER_OSPEEDR10_1                                   GPIO_OSSEL_OSSEL10_1
#define GPIO_OSPEEDER_OSPEEDR11                                     GPIO_OSSEL_OSSEL11
#define GPIO_OSPEEDER_OSPEEDR11_0                                   GPIO_OSSEL_OSSEL11_0
#define GPIO_OSPEEDER_OSPEEDR11_1                                   GPIO_OSSEL_OSSEL11_1
#define GPIO_OSPEEDER_OSPEEDR12                                     GPIO_OSSEL_OSSEL12
#define GPIO_OSPEEDER_OSPEEDR12_0                                   GPIO_OSSEL_OSSEL12_0
#define GPIO_OSPEEDER_OSPEEDR12_1                                   GPIO_OSSEL_OSSEL12_1
#define GPIO_OSPEEDER_OSPEEDR13                                     GPIO_OSSEL_OSSEL13
#define GPIO_OSPEEDER_OSPEEDR13_0                                   GPIO_OSSEL_OSSEL13_0
#define GPIO_OSPEEDER_OSPEEDR13_1                                   GPIO_OSSEL_OSSEL13_1
#define GPIO_OSPEEDER_OSPEEDR14                                     GPIO_OSSEL_OSSEL14
#define GPIO_OSPEEDER_OSPEEDR14_0                                   GPIO_OSSEL_OSSEL14_0
#define GPIO_OSPEEDER_OSPEEDR14_1                                   GPIO_OSSEL_OSSEL14_1
#define GPIO_OSPEEDER_OSPEEDR15                                     GPIO_OSSEL_OSSEL15
#define GPIO_OSPEEDER_OSPEEDR15_0                                   GPIO_OSSEL_OSSEL15_0
#define GPIO_OSPEEDER_OSPEEDR15_1                                   GPIO_OSSEL_OSSEL15_1

/******************  Bits definition for GPIO_PUPD register  *****************/
#define GPIO_PUPD_PUPD0_Pos                                         (0U)
#define GPIO_PUPD_PUPD0_Msk                                         (0x3UL << GPIO_PUPD_PUPD0_Pos)                                 /*!< 0x00000003 */
#define GPIO_PUPD_PUPD0                                             GPIO_PUPD_PUPD0_Msk
#define GPIO_PUPD_PUPD0_0                                           (0x1UL << GPIO_PUPD_PUPD0_Pos)                                 /*!< 0x00000001 */
#define GPIO_PUPD_PUPD0_1                                           (0x2UL << GPIO_PUPD_PUPD0_Pos)                                 /*!< 0x00000002 */
#define GPIO_PUPD_PUPD1_Pos                                         (2U)
#define GPIO_PUPD_PUPD1_Msk                                         (0x3UL << GPIO_PUPD_PUPD1_Pos)                                 /*!< 0x0000000C */
#define GPIO_PUPD_PUPD1                                             GPIO_PUPD_PUPD1_Msk
#define GPIO_PUPD_PUPD1_0                                           (0x1UL << GPIO_PUPD_PUPD1_Pos)                                 /*!< 0x00000004 */
#define GPIO_PUPD_PUPD1_1                                           (0x2UL << GPIO_PUPD_PUPD1_Pos)                                 /*!< 0x00000008 */
#define GPIO_PUPD_PUPD2_Pos                                         (4U)
#define GPIO_PUPD_PUPD2_Msk                                         (0x3UL << GPIO_PUPD_PUPD2_Pos)                                 /*!< 0x00000030 */
#define GPIO_PUPD_PUPD2                                             GPIO_PUPD_PUPD2_Msk
#define GPIO_PUPD_PUPD2_0                                           (0x1UL << GPIO_PUPD_PUPD2_Pos)                                 /*!< 0x00000010 */
#define GPIO_PUPD_PUPD2_1                                           (0x2UL << GPIO_PUPD_PUPD2_Pos)                                 /*!< 0x00000020 */
#define GPIO_PUPD_PUPD3_Pos                                         (6U)
#define GPIO_PUPD_PUPD3_Msk                                         (0x3UL << GPIO_PUPD_PUPD3_Pos)                                 /*!< 0x000000C0 */
#define GPIO_PUPD_PUPD3                                             GPIO_PUPD_PUPD3_Msk
#define GPIO_PUPD_PUPD3_0                                           (0x1UL << GPIO_PUPD_PUPD3_Pos)                                 /*!< 0x00000040 */
#define GPIO_PUPD_PUPD3_1                                           (0x2UL << GPIO_PUPD_PUPD3_Pos)                                 /*!< 0x00000080 */
#define GPIO_PUPD_PUPD4_Pos                                         (8U)
#define GPIO_PUPD_PUPD4_Msk                                         (0x3UL << GPIO_PUPD_PUPD4_Pos)                                 /*!< 0x00000300 */
#define GPIO_PUPD_PUPD4                                             GPIO_PUPD_PUPD4_Msk
#define GPIO_PUPD_PUPD4_0                                           (0x1UL << GPIO_PUPD_PUPD4_Pos)                                 /*!< 0x00000100 */
#define GPIO_PUPD_PUPD4_1                                           (0x2UL << GPIO_PUPD_PUPD4_Pos)                                 /*!< 0x00000200 */
#define GPIO_PUPD_PUPD5_Pos                                         (10U)
#define GPIO_PUPD_PUPD5_Msk                                         (0x3UL << GPIO_PUPD_PUPD5_Pos)                                 /*!< 0x00000C00 */
#define GPIO_PUPD_PUPD5                                             GPIO_PUPD_PUPD5_Msk
#define GPIO_PUPD_PUPD5_0                                           (0x1UL << GPIO_PUPD_PUPD5_Pos)                                 /*!< 0x00000400 */
#define GPIO_PUPD_PUPD5_1                                           (0x2UL << GPIO_PUPD_PUPD5_Pos)                                 /*!< 0x00000800 */
#define GPIO_PUPD_PUPD6_Pos                                         (12U)
#define GPIO_PUPD_PUPD6_Msk                                         (0x3UL << GPIO_PUPD_PUPD6_Pos)                                 /*!< 0x00003000 */
#define GPIO_PUPD_PUPD6                                             GPIO_PUPD_PUPD6_Msk
#define GPIO_PUPD_PUPD6_0                                           (0x1UL << GPIO_PUPD_PUPD6_Pos)                                 /*!< 0x00001000 */
#define GPIO_PUPD_PUPD6_1                                           (0x2UL << GPIO_PUPD_PUPD6_Pos)                                 /*!< 0x00002000 */
#define GPIO_PUPD_PUPD7_Pos                                         (14U)
#define GPIO_PUPD_PUPD7_Msk                                         (0x3UL << GPIO_PUPD_PUPD7_Pos)                                 /*!< 0x0000C000 */
#define GPIO_PUPD_PUPD7                                             GPIO_PUPD_PUPD7_Msk
#define GPIO_PUPD_PUPD7_0                                           (0x1UL << GPIO_PUPD_PUPD7_Pos)                                 /*!< 0x00004000 */
#define GPIO_PUPD_PUPD7_1                                           (0x2UL << GPIO_PUPD_PUPD7_Pos)                                 /*!< 0x00008000 */
#define GPIO_PUPD_PUPD8_Pos                                         (16U)
#define GPIO_PUPD_PUPD8_Msk                                         (0x3UL << GPIO_PUPD_PUPD8_Pos)                                 /*!< 0x00030000 */
#define GPIO_PUPD_PUPD8                                             GPIO_PUPD_PUPD8_Msk
#define GPIO_PUPD_PUPD8_0                                           (0x1UL << GPIO_PUPD_PUPD8_Pos)                                 /*!< 0x00010000 */
#define GPIO_PUPD_PUPD8_1                                           (0x2UL << GPIO_PUPD_PUPD8_Pos)                                 /*!< 0x00020000 */
#define GPIO_PUPD_PUPD9_Pos                                         (18U)
#define GPIO_PUPD_PUPD9_Msk                                         (0x3UL << GPIO_PUPD_PUPD9_Pos)                                 /*!< 0x000C0000 */
#define GPIO_PUPD_PUPD9                                             GPIO_PUPD_PUPD9_Msk
#define GPIO_PUPD_PUPD9_0                                           (0x1UL << GPIO_PUPD_PUPD9_Pos)                                 /*!< 0x00040000 */
#define GPIO_PUPD_PUPD9_1                                           (0x2UL << GPIO_PUPD_PUPD9_Pos)                                 /*!< 0x00080000 */
#define GPIO_PUPD_PUPD10_Pos                                        (20U)
#define GPIO_PUPD_PUPD10_Msk                                        (0x3UL << GPIO_PUPD_PUPD10_Pos)                                /*!< 0x00300000 */
#define GPIO_PUPD_PUPD10                                            GPIO_PUPD_PUPD10_Msk
#define GPIO_PUPD_PUPD10_0                                          (0x1UL << GPIO_PUPD_PUPD10_Pos)                                /*!< 0x00100000 */
#define GPIO_PUPD_PUPD10_1                                          (0x2UL << GPIO_PUPD_PUPD10_Pos)                                /*!< 0x00200000 */
#define GPIO_PUPD_PUPD11_Pos                                        (22U)
#define GPIO_PUPD_PUPD11_Msk                                        (0x3UL << GPIO_PUPD_PUPD11_Pos)                                /*!< 0x00C00000 */
#define GPIO_PUPD_PUPD11                                            GPIO_PUPD_PUPD11_Msk
#define GPIO_PUPD_PUPD11_0                                          (0x1UL << GPIO_PUPD_PUPD11_Pos)                                /*!< 0x00400000 */
#define GPIO_PUPD_PUPD11_1                                          (0x2UL << GPIO_PUPD_PUPD11_Pos)                                /*!< 0x00800000 */
#define GPIO_PUPD_PUPD12_Pos                                        (24U)
#define GPIO_PUPD_PUPD12_Msk                                        (0x3UL << GPIO_PUPD_PUPD12_Pos)                                /*!< 0x03000000 */
#define GPIO_PUPD_PUPD12                                            GPIO_PUPD_PUPD12_Msk
#define GPIO_PUPD_PUPD12_0                                          (0x1UL << GPIO_PUPD_PUPD12_Pos)                                /*!< 0x01000000 */
#define GPIO_PUPD_PUPD12_1                                          (0x2UL << GPIO_PUPD_PUPD12_Pos)                                /*!< 0x02000000 */
#define GPIO_PUPD_PUPD13_Pos                                        (26U)
#define GPIO_PUPD_PUPD13_Msk                                        (0x3UL << GPIO_PUPD_PUPD13_Pos)                                /*!< 0x0C000000 */
#define GPIO_PUPD_PUPD13                                            GPIO_PUPD_PUPD13_Msk
#define GPIO_PUPD_PUPD13_0                                          (0x1UL << GPIO_PUPD_PUPD13_Pos)                                /*!< 0x04000000 */
#define GPIO_PUPD_PUPD13_1                                          (0x2UL << GPIO_PUPD_PUPD13_Pos)                                /*!< 0x08000000 */
#define GPIO_PUPD_PUPD14_Pos                                        (28U)
#define GPIO_PUPD_PUPD14_Msk                                        (0x3UL << GPIO_PUPD_PUPD14_Pos)                                /*!< 0x30000000 */
#define GPIO_PUPD_PUPD14                                            GPIO_PUPD_PUPD14_Msk
#define GPIO_PUPD_PUPD14_0                                          (0x1UL << GPIO_PUPD_PUPD14_Pos)                                /*!< 0x10000000 */
#define GPIO_PUPD_PUPD14_1                                          (0x2UL << GPIO_PUPD_PUPD14_Pos)                                /*!< 0x20000000 */
#define GPIO_PUPD_PUPD15_Pos                                        (30U)
#define GPIO_PUPD_PUPD15_Msk                                        (0x3UL << GPIO_PUPD_PUPD15_Pos)                                /*!< 0xC0000000 */
#define GPIO_PUPD_PUPD15                                            GPIO_PUPD_PUPD15_Msk
#define GPIO_PUPD_PUPD15_0                                          (0x1UL << GPIO_PUPD_PUPD15_Pos)                                /*!< 0x40000000 */
#define GPIO_PUPD_PUPD15_1                                          (0x2UL << GPIO_PUPD_PUPD15_Pos)                                /*!< 0x80000000 */

