LuckkMaker/betaflight/lib/main/APM32F4/Libraries/Device/Geehy/APM32F4xx/Include/apm32f423xx.h
/* Legacy defines */
#define GPIO_ALFL_AFRL0                                             GPIO_ALFL_ALFSEL0
#define GPIO_ALFL_AFRL0_0                                           GPIO_ALFL_ALFSEL0_0
#define GPIO_ALFL_AFRL0_1                                           GPIO_ALFL_ALFSEL0_1
#define GPIO_ALFL_AFRL0_2                                           GPIO_ALFL_ALFSEL0_2
#define GPIO_ALFL_AFRL0_3                                           GPIO_ALFL_ALFSEL0_3
#define GPIO_ALFL_AFRL1                                             GPIO_ALFL_ALFSEL1
#define GPIO_ALFL_AFRL1_0                                           GPIO_ALFL_ALFSEL1_0
#define GPIO_ALFL_AFRL1_1                                           GPIO_ALFL_ALFSEL1_1
#define GPIO_ALFL_AFRL1_2                                           GPIO_ALFL_ALFSEL1_2
#define GPIO_ALFL_AFRL1_3                                           GPIO_ALFL_ALFSEL1_3
#define GPIO_ALFL_AFRL2                                             GPIO_ALFL_ALFSEL2
#define GPIO_ALFL_AFRL2_0                                           GPIO_ALFL_ALFSEL2_0
#define GPIO_ALFL_AFRL2_1                                           GPIO_ALFL_ALFSEL2_1
#define GPIO_ALFL_AFRL2_2                                           GPIO_ALFL_ALFSEL2_2
#define GPIO_ALFL_AFRL2_3                                           GPIO_ALFL_ALFSEL2_3
#define GPIO_ALFL_AFRL3                                             GPIO_ALFL_ALFSEL3
#define GPIO_ALFL_AFRL3_0                                           GPIO_ALFL_ALFSEL3_0
#define GPIO_ALFL_AFRL3_1                                           GPIO_ALFL_ALFSEL3_1
#define GPIO_ALFL_AFRL3_2                                           GPIO_ALFL_ALFSEL3_2
#define GPIO_ALFL_AFRL3_3                                           GPIO_ALFL_ALFSEL3_3
#define GPIO_ALFL_AFRL4                                             GPIO_ALFL_ALFSEL4
#define GPIO_ALFL_AFRL4_0                                           GPIO_ALFL_ALFSEL4_0
#define GPIO_ALFL_AFRL4_1                                           GPIO_ALFL_ALFSEL4_1
#define GPIO_ALFL_AFRL4_2                                           GPIO_ALFL_ALFSEL4_2
#define GPIO_ALFL_AFRL4_3                                           GPIO_ALFL_ALFSEL4_3
#define GPIO_ALFL_AFRL5                                             GPIO_ALFL_ALFSEL5
#define GPIO_ALFL_AFRL5_0                                           GPIO_ALFL_ALFSEL5_0
#define GPIO_ALFL_AFRL5_1                                           GPIO_ALFL_ALFSEL5_1
#define GPIO_ALFL_AFRL5_2                                           GPIO_ALFL_ALFSEL5_2
#define GPIO_ALFL_AFRL5_3                                           GPIO_ALFL_ALFSEL5_3
#define GPIO_ALFL_AFRL6                                             GPIO_ALFL_ALFSEL6
#define GPIO_ALFL_AFRL6_0                                           GPIO_ALFL_ALFSEL6_0
#define GPIO_ALFL_AFRL6_1                                           GPIO_ALFL_ALFSEL6_1
#define GPIO_ALFL_AFRL6_2                                           GPIO_ALFL_ALFSEL6_2
#define GPIO_ALFL_AFRL6_3                                           GPIO_ALFL_ALFSEL6_3
#define GPIO_ALFL_AFRL7                                             GPIO_ALFL_ALFSEL7
#define GPIO_ALFL_AFRL7_0                                           GPIO_ALFL_ALFSEL7_0
#define GPIO_ALFL_AFRL7_1                                           GPIO_ALFL_ALFSEL7_1
#define GPIO_ALFL_AFRL7_2                                           GPIO_ALFL_ALFSEL7_2
#define GPIO_ALFL_AFRL7_3                                           GPIO_ALFL_ALFSEL7_3

/****************** Bit definition for GPIO_ALFH register *********************/
#define GPIO_ALFH_ALFSEL8_Pos                                       (0U)
#define GPIO_ALFH_ALFSEL8_Msk                                       (0xFUL << GPIO_ALFH_ALFSEL8_Pos)                               /*!< 0x0000000F */
#define GPIO_ALFH_ALFSEL8                                           GPIO_ALFH_ALFSEL8_Msk
#define GPIO_ALFH_ALFSEL8_0                                         (0x1UL << GPIO_ALFH_ALFSEL8_Pos)                               /*!< 0x00000001 */
#define GPIO_ALFH_ALFSEL8_1                                         (0x2UL << GPIO_ALFH_ALFSEL8_Pos)                               /*!< 0x00000002 */
#define GPIO_ALFH_ALFSEL8_2                                         (0x4UL << GPIO_ALFH_ALFSEL8_Pos)                               /*!< 0x00000004 */
#define GPIO_ALFH_ALFSEL8_3                                         (0x8UL << GPIO_ALFH_ALFSEL8_Pos)                               /*!< 0x00000008 */
#define GPIO_ALFH_ALFSEL9_Pos                                       (4U)
#define GPIO_ALFH_ALFSEL9_Msk                                       (0xFUL << GPIO_ALFH_ALFSEL9_Pos)                               /*!< 0x000000F0 */
#define GPIO_ALFH_ALFSEL9                                           GPIO_ALFH_ALFSEL9_Msk
#define GPIO_ALFH_ALFSEL9_0                                         (0x1UL << GPIO_ALFH_ALFSEL9_Pos)                               /*!< 0x00000010 */
#define GPIO_ALFH_ALFSEL9_1                                         (0x2UL << GPIO_ALFH_ALFSEL9_Pos)                               /*!< 0x00000020 */
#define GPIO_ALFH_ALFSEL9_2                                         (0x4UL << GPIO_ALFH_ALFSEL9_Pos)                               /*!< 0x00000040 */
#define GPIO_ALFH_ALFSEL9_3                                         (0x8UL << GPIO_ALFH_ALFSEL9_Pos)                               /*!< 0x00000080 */
#define GPIO_ALFH_ALFSEL10_Pos                                      (8U)
#define GPIO_ALFH_ALFSEL10_Msk                                      (0xFUL << GPIO_ALFH_ALFSEL10_Pos)                              /*!< 0x00000F00 */
#define GPIO_ALFH_ALFSEL10                                          GPIO_ALFH_ALFSEL10_Msk
#define GPIO_ALFH_ALFSEL10_0                                        (0x1UL << GPIO_ALFH_ALFSEL10_Pos)                              /*!< 0x00000100 */
#define GPIO_ALFH_ALFSEL10_1                                        (0x2UL << GPIO_ALFH_ALFSEL10_Pos)                              /*!< 0x00000200 */
#define GPIO_ALFH_ALFSEL10_2                                        (0x4UL << GPIO_ALFH_ALFSEL10_Pos)                              /*!< 0x00000400 */
#define GPIO_ALFH_ALFSEL10_3                                        (0x8UL << GPIO_ALFH_ALFSEL10_Pos)                              /*!< 0x00000800 */
#define GPIO_ALFH_ALFSEL11_Pos                                      (12U)
#define GPIO_ALFH_ALFSEL11_Msk                                      (0xFUL << GPIO_ALFH_ALFSEL11_Pos)                              /*!< 0x0000F000 */
#define GPIO_ALFH_ALFSEL11                                          GPIO_ALFH_ALFSEL11_Msk
#define GPIO_ALFH_ALFSEL11_0                                        (0x1UL << GPIO_ALFH_ALFSEL11_Pos)                              /*!< 0x00001000 */
#define GPIO_ALFH_ALFSEL11_1                                        (0x2UL << GPIO_ALFH_ALFSEL11_Pos)                              /*!< 0x00002000 */
#define GPIO_ALFH_ALFSEL11_2                                        (0x4UL << GPIO_ALFH_ALFSEL11_Pos)                              /*!< 0x00004000 */
#define GPIO_ALFH_ALFSEL11_3                                        (0x8UL << GPIO_ALFH_ALFSEL11_Pos)                              /*!< 0x00008000 */
#define GPIO_ALFH_ALFSEL12_Pos                                      (16U)
#define GPIO_ALFH_ALFSEL12_Msk                                      (0xFUL << GPIO_ALFH_ALFSEL12_Pos)                              /*!< 0x000F0000 */
#define GPIO_ALFH_ALFSEL12                                          GPIO_ALFH_ALFSEL12_Msk
#define GPIO_ALFH_ALFSEL12_0                                        (0x1UL << GPIO_ALFH_ALFSEL12_Pos)                              /*!< 0x00010000 */
#define GPIO_ALFH_ALFSEL12_1                                        (0x2UL << GPIO_ALFH_ALFSEL12_Pos)                              /*!< 0x00020000 */
#define GPIO_ALFH_ALFSEL12_2                                        (0x4UL << GPIO_ALFH_ALFSEL12_Pos)                              /*!< 0x00040000 */
#define GPIO_ALFH_ALFSEL12_3                                        (0x8UL << GPIO_ALFH_ALFSEL12_Pos)                              /*!< 0x00080000 */
#define GPIO_ALFH_ALFSEL13_Pos                                      (20U)
#define GPIO_ALFH_ALFSEL13_Msk                                      (0xFUL << GPIO_ALFH_ALFSEL13_Pos)                              /*!< 0x00F00000 */
#define GPIO_ALFH_ALFSEL13                                          GPIO_ALFH_ALFSEL13_Msk
#define GPIO_ALFH_ALFSEL13_0                                        (0x1UL << GPIO_ALFH_ALFSEL13_Pos)                              /*!< 0x00100000 */
#define GPIO_ALFH_ALFSEL13_1                                        (0x2UL << GPIO_ALFH_ALFSEL13_Pos)                              /*!< 0x00200000 */
#define GPIO_ALFH_ALFSEL13_2                                        (0x4UL << GPIO_ALFH_ALFSEL13_Pos)                              /*!< 0x00400000 */
#define GPIO_ALFH_ALFSEL13_3                                        (0x8UL << GPIO_ALFH_ALFSEL13_Pos)                              /*!< 0x00800000 */
#define GPIO_ALFH_ALFSEL14_Pos                                      (24U)
#define GPIO_ALFH_ALFSEL14_Msk                                      (0xFUL << GPIO_ALFH_ALFSEL14_Pos)                              /*!< 0x0F000000 */
#define GPIO_ALFH_ALFSEL14                                          GPIO_ALFH_ALFSEL14_Msk
#define GPIO_ALFH_ALFSEL14_0                                        (0x1UL << GPIO_ALFH_ALFSEL14_Pos)                              /*!< 0x01000000 */
#define GPIO_ALFH_ALFSEL14_1                                        (0x2UL << GPIO_ALFH_ALFSEL14_Pos)                              /*!< 0x02000000 */
#define GPIO_ALFH_ALFSEL14_2                                        (0x4UL << GPIO_ALFH_ALFSEL14_Pos)                              /*!< 0x04000000 */
#define GPIO_ALFH_ALFSEL14_3                                        (0x8UL << GPIO_ALFH_ALFSEL14_Pos)                              /*!< 0x08000000 */
#define GPIO_ALFH_ALFSEL15_Pos                                      (28U)
#define GPIO_ALFH_ALFSEL15_Msk                                      (0xFUL << GPIO_ALFH_ALFSEL15_Pos)                              /*!< 0xF0000000 */
#define GPIO_ALFH_ALFSEL15                                          GPIO_ALFH_ALFSEL15_Msk
#define GPIO_ALFH_ALFSEL15_0                                        (0x1UL << GPIO_ALFH_ALFSEL15_Pos)                              /*!< 0x10000000 */
#define GPIO_ALFH_ALFSEL15_1                                        (0x2UL << GPIO_ALFH_ALFSEL15_Pos)                              /*!< 0x20000000 */
#define GPIO_ALFH_ALFSEL15_2                                        (0x4UL << GPIO_ALFH_ALFSEL15_Pos)                              /*!< 0x40000000 */
#define GPIO_ALFH_ALFSEL15_3                                        (0x8UL << GPIO_ALFH_ALFSEL15_Pos)                              /*!< 0x80000000 */

