LuckkMaker/betaflight/lib/main/APM32F4/Libraries/Device/Geehy/APM32F4xx/Include/apm32f423xx.h
#define RCM_CFG_MCO1PSC_Pos                                         (24U)
#define RCM_CFG_MCO1PSC_Msk                                         (0x7UL << RCM_CFG_MCO1PSC_Pos)                                 /*!< 0x07000000 */
#define RCM_CFG_MCO1PSC                                             RCM_CFG_MCO1PSC_Msk
#define RCM_CFG_MCO1PSC_0                                           (0x1UL << RCM_CFG_MCO1PSC_Pos)                                 /*!< 0x01000000 */
#define RCM_CFG_MCO1PSC_1                                           (0x2UL << RCM_CFG_MCO1PSC_Pos)                                 /*!< 0x02000000 */
#define RCM_CFG_MCO1PSC_2                                           (0x4UL << RCM_CFG_MCO1PSC_Pos)                                 /*!< 0x04000000 */

#define RCM_CFG_MCO2PSC_Pos                                         (27U)
#define RCM_CFG_MCO2PSC_Msk                                         (0x7UL << RCM_CFG_MCO2PSC_Pos)                                 /*!< 0x38000000 */
#define RCM_CFG_MCO2PSC                                             RCM_CFG_MCO2PSC_Msk
#define RCM_CFG_MCO2PSC_0                                           (0x1UL << RCM_CFG_MCO2PSC_Pos)                                 /*!< 0x08000000 */
#define RCM_CFG_MCO2PSC_1                                           (0x2UL << RCM_CFG_MCO2PSC_Pos)                                 /*!< 0x10000000 */
#define RCM_CFG_MCO2PSC_2                                           (0x4UL << RCM_CFG_MCO2PSC_Pos)                                 /*!< 0x20000000 */

#define RCM_CFG_MCO2SEL_Pos                                         (30U)
#define RCM_CFG_MCO2SEL_Msk                                         (0x3UL << RCM_CFG_MCO2SEL_Pos)                                 /*!< 0xC0000000 */
#define RCM_CFG_MCO2SEL                                             RCM_CFG_MCO2SEL_Msk
#define RCM_CFG_MCO2SEL_0                                           (0x1UL << RCM_CFG_MCO2SEL_Pos)                                 /*!< 0x40000000 */
#define RCM_CFG_MCO2SEL_1                                           (0x2UL << RCM_CFG_MCO2SEL_Pos)                                 /*!< 0x80000000 */

/********************  Bit definition for RCM_INT register  *******************/
#define RCM_INT_LSIRDYFLG_Pos                                       (0U)
#define RCM_INT_LSIRDYFLG_Msk                                       (0x1UL << RCM_INT_LSIRDYFLG_Pos)                               /*!< 0x00000001 */
#define RCM_INT_LSIRDYFLG                                           RCM_INT_LSIRDYFLG_Msk
#define RCM_INT_LSERDYFLG_Pos                                       (1U)
#define RCM_INT_LSERDYFLG_Msk                                       (0x1UL << RCM_INT_LSERDYFLG_Pos)                               /*!< 0x00000002 */
#define RCM_INT_LSERDYFLG                                           RCM_INT_LSERDYFLG_Msk
#define RCM_INT_HSIRDYFLG_Pos                                       (2U)
#define RCM_INT_HSIRDYFLG_Msk                                       (0x1UL << RCM_INT_HSIRDYFLG_Pos)                               /*!< 0x00000004 */
#define RCM_INT_HSIRDYFLG                                           RCM_INT_HSIRDYFLG_Msk
#define RCM_INT_HSERDYFLG_Pos                                       (3U)
#define RCM_INT_HSERDYFLG_Msk                                       (0x1UL << RCM_INT_HSERDYFLG_Pos)                               /*!< 0x00000008 */
#define RCM_INT_HSERDYFLG                                           RCM_INT_HSERDYFLG_Msk
#define RCM_INT_PLL1RDYFLG_Pos                                      (4U)
#define RCM_INT_PLL1RDYFLG_Msk                                      (0x1UL << RCM_INT_PLL1RDYFLG_Pos)                              /*!< 0x00000010 */
#define RCM_INT_PLL1RDYFLG                                          RCM_INT_PLL1RDYFLG_Msk

#define RCM_INT_CSSFLG_Pos                                          (7U)
#define RCM_INT_CSSFLG_Msk                                          (0x1UL << RCM_INT_CSSFLG_Pos)                                  /*!< 0x00000080 */
#define RCM_INT_CSSFLG                                              RCM_INT_CSSFLG_Msk
#define RCM_INT_LSIRDYEN_Pos                                        (8U)
#define RCM_INT_LSIRDYEN_Msk                                        (0x1UL << RCM_INT_LSIRDYEN_Pos)                                /*!< 0x00000100 */
#define RCM_INT_LSIRDYEN                                            RCM_INT_LSIRDYEN_Msk
#define RCM_INT_LSERDYEN_Pos                                        (9U)
#define RCM_INT_LSERDYEN_Msk                                        (0x1UL << RCM_INT_LSERDYEN_Pos)                                /*!< 0x00000200 */
#define RCM_INT_LSERDYEN                                            RCM_INT_LSERDYEN_Msk
#define RCM_INT_HSIRDYEN_Pos                                        (10U)
#define RCM_INT_HSIRDYEN_Msk                                        (0x1UL << RCM_INT_HSIRDYEN_Pos)                                /*!< 0x00000400 */
#define RCM_INT_HSIRDYEN                                            RCM_INT_HSIRDYEN_Msk
#define RCM_INT_HSERDYEN_Pos                                        (11U)
#define RCM_INT_HSERDYEN_Msk                                        (0x1UL << RCM_INT_HSERDYEN_Pos)                                /*!< 0x00000800 */
#define RCM_INT_HSERDYEN                                            RCM_INT_HSERDYEN_Msk
#define RCM_INT_PLL1RDYEN_Pos                                       (12U)
#define RCM_INT_PLL1RDYEN_Msk                                       (0x1UL << RCM_INT_PLL1RDYEN_Pos)                               /*!< 0x00001000 */
#define RCM_INT_PLL1RDYEN                                           RCM_INT_PLL1RDYEN_Msk

#define RCM_INT_LSIRDYCLR_Pos                                       (16U)
#define RCM_INT_LSIRDYCLR_Msk                                       (0x1UL << RCM_INT_LSIRDYCLR_Pos)                               /*!< 0x00010000 */
#define RCM_INT_LSIRDYCLR                                           RCM_INT_LSIRDYCLR_Msk
#define RCM_INT_LSERDYCLR_Pos                                       (17U)
#define RCM_INT_LSERDYCLR_Msk                                       (0x1UL << RCM_INT_LSERDYCLR_Pos)                               /*!< 0x00020000 */
#define RCM_INT_LSERDYCLR                                           RCM_INT_LSERDYCLR_Msk
#define RCM_INT_HSIRDYCLR_Pos                                       (18U)
#define RCM_INT_HSIRDYCLR_Msk                                       (0x1UL << RCM_INT_HSIRDYCLR_Pos)                               /*!< 0x00040000 */
#define RCM_INT_HSIRDYCLR                                           RCM_INT_HSIRDYCLR_Msk
#define RCM_INT_HSERDYCLR_Pos                                       (19U)
#define RCM_INT_HSERDYCLR_Msk                                       (0x1UL << RCM_INT_HSERDYCLR_Pos)                               /*!< 0x00080000 */
#define RCM_INT_HSERDYCLR                                           RCM_INT_HSERDYCLR_Msk
#define RCM_INT_PLL1RDYCLR_Pos                                      (20U)
#define RCM_INT_PLL1RDYCLR_Msk                                      (0x1UL << RCM_INT_PLL1RDYCLR_Pos)                              /*!< 0x00100000 */
#define RCM_INT_PLL1RDYCLR                                          RCM_INT_PLL1RDYCLR_Msk

#define RCM_INT_CSSCLR_Pos                                          (23U)
#define RCM_INT_CSSCLR_Msk                                          (0x1UL << RCM_INT_CSSCLR_Pos)                                  /*!< 0x00800000 */
#define RCM_INT_CSSCLR                                              RCM_INT_CSSCLR_Msk

/********************  Bit definition for RCM_AHB1RST register  **************/
#define RCM_AHB1RST_PARST_Pos                                       (0U)
#define RCM_AHB1RST_PARST_Msk                                       (0x1UL << RCM_AHB1RST_PARST_Pos)                               /*!< 0x00000001 */
#define RCM_AHB1RST_PARST                                           RCM_AHB1RST_PARST_Msk
#define RCM_AHB1RST_PBRST_Pos                                       (1U)
#define RCM_AHB1RST_PBRST_Msk                                       (0x1UL << RCM_AHB1RST_PBRST_Pos)                               /*!< 0x00000002 */
#define RCM_AHB1RST_PBRST                                           RCM_AHB1RST_PBRST_Msk
#define RCM_AHB1RST_PCRST_Pos                                       (2U)
#define RCM_AHB1RST_PCRST_Msk                                       (0x1UL << RCM_AHB1RST_PCRST_Pos)                               /*!< 0x00000004 */
#define RCM_AHB1RST_PCRST                                           RCM_AHB1RST_PCRST_Msk
#define RCM_AHB1RST_PDRST_Pos                                       (3U)
#define RCM_AHB1RST_PDRST_Msk                                       (0x1UL << RCM_AHB1RST_PDRST_Pos)                               /*!< 0x00000008 */
#define RCM_AHB1RST_PDRST                                           RCM_AHB1RST_PDRST_Msk
#define RCM_AHB1RST_PERST_Pos                                       (4U)
#define RCM_AHB1RST_PERST_Msk                                       (0x1UL << RCM_AHB1RST_PERST_Pos)                               /*!< 0x00000010 */
#define RCM_AHB1RST_PERST                                           RCM_AHB1RST_PERST_Msk
#define RCM_AHB1RST_PFRST_Pos                                       (5U)
#define RCM_AHB1RST_PFRST_Msk                                       (0x1UL << RCM_AHB1RST_PFRST_Pos)                               /*!< 0x00000020 */
#define RCM_AHB1RST_PFRST                                           RCM_AHB1RST_PFRST_Msk
#define RCM_AHB1RST_PGRST_Pos                                       (6U)
#define RCM_AHB1RST_PGRST_Msk                                       (0x1UL << RCM_AHB1RST_PGRST_Pos)                               /*!< 0x00000040 */
#define RCM_AHB1RST_PGRST                                           RCM_AHB1RST_PGRST_Msk
#define RCM_AHB1RST_PHRST_Pos                                       (7U)
#define RCM_AHB1RST_PHRST_Msk                                       (0x1UL << RCM_AHB1RST_PHRST_Pos)                               /*!< 0x00000080 */
#define RCM_AHB1RST_PHRST                                           RCM_AHB1RST_PHRST_Msk
#define RCM_AHB1RST_CRCRST_Pos                                      (12U)
#define RCM_AHB1RST_CRCRST_Msk                                      (0x1UL << RCM_AHB1RST_CRCRST_Pos)                              /*!< 0x00001000 */
#define RCM_AHB1RST_CRCRST                                          RCM_AHB1RST_CRCRST_Msk
#define RCM_AHB1RST_DMA1RST_Pos                                     (21U)
#define RCM_AHB1RST_DMA1RST_Msk                                     (0x1UL << RCM_AHB1RST_DMA1RST_Pos)                             /*!< 0x00200000 */
#define RCM_AHB1RST_DMA1RST                                         RCM_AHB1RST_DMA1RST_Msk
#define RCM_AHB1RST_DMA2RST_Pos                                     (22U)
#define RCM_AHB1RST_DMA2RST_Msk                                     (0x1UL << RCM_AHB1RST_DMA2RST_Pos)                             /*!< 0x00400000 */
#define RCM_AHB1RST_DMA2RST                                         RCM_AHB1RST_DMA2RST_Msk
#define RCM_AHB1RST_ETHRST_Pos                                      (25U)
#define RCM_AHB1RST_ETHRST_Msk                                      (0x1UL << RCM_AHB1RST_ETHRST_Pos)                              /*!< 0x02000000 */
#define RCM_AHB1RST_ETHRST                                          RCM_AHB1RST_ETHRST_Msk
#define RCM_AHB1RST_OTGFS2RST_Pos                                   (29U)
#define RCM_AHB1RST_OTGFS2RST_Msk                                   (0x1UL << RCM_AHB1RST_OTGFS2RST_Pos)                           /*!< 0x20000000 */
#define RCM_AHB1RST_OTGFS2RST                                       RCM_AHB1RST_OTGFS2RST_Msk

/********************  Bit definition for RCM_AHB2RST register  **************/
#define RCM_AHB2RST_RNGRST_Pos                                      (6U)
#define RCM_AHB2RST_RNGRST_Msk                                      (0x1UL << RCM_AHB2RST_RNGRST_Pos)                              /*!< 0x00000040 */
#define RCM_AHB2RST_RNGRST                                          RCM_AHB2RST_RNGRST_Msk
#define RCM_AHB2RST_OTGFSRST_Pos                                    (7U)
#define RCM_AHB2RST_OTGFSRST_Msk                                    (0x1UL << RCM_AHB2RST_OTGFSRST_Pos)                            /*!< 0x00000080 */
#define RCM_AHB2RST_OTGFSRST                                        RCM_AHB2RST_OTGFSRST_Msk
/********************  Bit definition for RCM_AHB3RST register  **************/
#define RCM_AHB3RST_EMMCRST_Pos                                     (0U)
#define RCM_AHB3RST_EMMCRST_Msk                                     (0x1UL << RCM_AHB3RST_EMMCRST_Pos)                             /*!< 0x00000001 */
#define RCM_AHB3RST_EMMCRST                                         RCM_AHB3RST_EMMCRST_Msk
#define RCM_AHB3RST_QSPIRST_Pos                                     (1U)
#define RCM_AHB3RST_QSPIRST_Msk                                     (0x1UL << RCM_AHB3RST_QSPIRST_Pos)                             /*!< 0x00000002 */
#define RCM_AHB3RST_QSPIRST                                         RCM_AHB3RST_QSPIRST_Msk

/********************  Bit definition for RCM_APB1RST register  **************/
#define RCM_APB1RST_TMR2RST_Pos                                     (0U)
#define RCM_APB1RST_TMR2RST_Msk                                     (0x1UL << RCM_APB1RST_TMR2RST_Pos)                             /*!< 0x00000001 */
#define RCM_APB1RST_TMR2RST                                         RCM_APB1RST_TMR2RST_Msk
#define RCM_APB1RST_TMR3RST_Pos                                     (1U)
#define RCM_APB1RST_TMR3RST_Msk                                     (0x1UL << RCM_APB1RST_TMR3RST_Pos)                             /*!< 0x00000002 */
#define RCM_APB1RST_TMR3RST                                         RCM_APB1RST_TMR3RST_Msk
#define RCM_APB1RST_TMR4RST_Pos                                     (2U)
#define RCM_APB1RST_TMR4RST_Msk                                     (0x1UL << RCM_APB1RST_TMR4RST_Pos)                             /*!< 0x00000004 */
#define RCM_APB1RST_TMR4RST                                         RCM_APB1RST_TMR4RST_Msk
#define RCM_APB1RST_TMR5RST_Pos                                     (3U)
#define RCM_APB1RST_TMR5RST_Msk                                     (0x1UL << RCM_APB1RST_TMR5RST_Pos)                             /*!< 0x00000008 */
#define RCM_APB1RST_TMR5RST                                         RCM_APB1RST_TMR5RST_Msk
#define RCM_APB1RST_TMR6RST_Pos                                     (4U)
#define RCM_APB1RST_TMR6RST_Msk                                     (0x1UL << RCM_APB1RST_TMR6RST_Pos)                             /*!< 0x00000010 */
#define RCM_APB1RST_TMR6RST                                         RCM_APB1RST_TMR6RST_Msk
#define RCM_APB1RST_TMR7RST_Pos                                     (5U)
#define RCM_APB1RST_TMR7RST_Msk                                     (0x1UL << RCM_APB1RST_TMR7RST_Pos)                             /*!< 0x00000020 */
#define RCM_APB1RST_TMR7RST                                         RCM_APB1RST_TMR7RST_Msk
#define RCM_APB1RST_TMR12RST_Pos                                    (6U)
#define RCM_APB1RST_TMR12RST_Msk                                    (0x1UL << RCM_APB1RST_TMR12RST_Pos)                            /*!< 0x00000040 */
#define RCM_APB1RST_TMR12RST                                        RCM_APB1RST_TMR12RST_Msk
#define RCM_APB1RST_TMR13RST_Pos                                    (7U)
#define RCM_APB1RST_TMR13RST_Msk                                    (0x1UL << RCM_APB1RST_TMR13RST_Pos)                            /*!< 0x00000080 */
#define RCM_APB1RST_TMR13RST                                        RCM_APB1RST_TMR13RST_Msk
#define RCM_APB1RST_TMR14RST_Pos                                    (8U)
#define RCM_APB1RST_TMR14RST_Msk                                    (0x1UL << RCM_APB1RST_TMR14RST_Pos)                            /*!< 0x00000100 */
#define RCM_APB1RST_TMR14RST                                        RCM_APB1RST_TMR14RST_Msk
#define RCM_APB1RST_WWDTRST_Pos                                     (11U)
#define RCM_APB1RST_WWDTRST_Msk                                     (0x1UL << RCM_APB1RST_WWDTRST_Pos)                             /*!< 0x00000800 */
#define RCM_APB1RST_WWDTRST                                         RCM_APB1RST_WWDTRST_Msk
#define RCM_APB1RST_SPI2RST_Pos                                     (14U)
#define RCM_APB1RST_SPI2RST_Msk                                     (0x1UL << RCM_APB1RST_SPI2RST_Pos)                             /*!< 0x00004000 */
#define RCM_APB1RST_SPI2RST                                         RCM_APB1RST_SPI2RST_Msk
#define RCM_APB1RST_SPI3RST_Pos                                     (15U)
#define RCM_APB1RST_SPI3RST_Msk                                     (0x1UL << RCM_APB1RST_SPI3RST_Pos)                             /*!< 0x00008000 */
#define RCM_APB1RST_SPI3RST                                         RCM_APB1RST_SPI3RST_Msk
#define RCM_APB1RST_USART2RST_Pos                                   (17U)
#define RCM_APB1RST_USART2RST_Msk                                   (0x1UL << RCM_APB1RST_USART2RST_Pos)                           /*!< 0x00020000 */
#define RCM_APB1RST_USART2RST                                       RCM_APB1RST_USART2RST_Msk
#define RCM_APB1RST_USART3RST_Pos                                   (18U)
#define RCM_APB1RST_USART3RST_Msk                                   (0x1UL << RCM_APB1RST_USART3RST_Pos)                           /*!< 0x00040000 */
#define RCM_APB1RST_USART3RST                                       RCM_APB1RST_USART3RST_Msk
#define RCM_APB1RST_UART4RST_Pos                                    (19U)
#define RCM_APB1RST_UART4RST_Msk                                    (0x1UL << RCM_APB1RST_UART4RST_Pos)                            /*!< 0x00080000 */
#define RCM_APB1RST_UART4RST                                        RCM_APB1RST_UART4RST_Msk
#define RCM_APB1RST_UART5RST_Pos                                    (20U)
#define RCM_APB1RST_UART5RST_Msk                                    (0x1UL << RCM_APB1RST_UART5RST_Pos)                            /*!< 0x00100000 */
#define RCM_APB1RST_UART5RST                                        RCM_APB1RST_UART5RST_Msk
#define RCM_APB1RST_I2C1RST_Pos                                     (21U)
#define RCM_APB1RST_I2C1RST_Msk                                     (0x1UL << RCM_APB1RST_I2C1RST_Pos)                             /*!< 0x00200000 */
#define RCM_APB1RST_I2C1RST                                         RCM_APB1RST_I2C1RST_Msk
#define RCM_APB1RST_I2C2RST_Pos                                     (22U)
#define RCM_APB1RST_I2C2RST_Msk                                     (0x1UL << RCM_APB1RST_I2C2RST_Pos)                             /*!< 0x00400000 */
#define RCM_APB1RST_I2C2RST                                         RCM_APB1RST_I2C2RST_Msk
#define RCM_APB1RST_I2C3RST_Pos                                     (23U)
#define RCM_APB1RST_I2C3RST_Msk                                     (0x1UL << RCM_APB1RST_I2C3RST_Pos)                             /*!< 0x00800000 */
#define RCM_APB1RST_I2C3RST                                         RCM_APB1RST_I2C3RST_Msk
#define RCM_APB1RST_CAN1RST_Pos                                     (25U)
#define RCM_APB1RST_CAN1RST_Msk                                     (0x1UL << RCM_APB1RST_CAN1RST_Pos)                             /*!< 0x02000000 */
#define RCM_APB1RST_CAN1RST                                         RCM_APB1RST_CAN1RST_Msk
#define RCM_APB1RST_CAN2RST_Pos                                     (26U)
#define RCM_APB1RST_CAN2RST_Msk                                     (0x1UL << RCM_APB1RST_CAN2RST_Pos)                             /*!< 0x04000000 */
#define RCM_APB1RST_CAN2RST                                         RCM_APB1RST_CAN2RST_Msk
#define RCM_APB1RST_PMURST_Pos                                      (28U)
#define RCM_APB1RST_PMURST_Msk                                      (0x1UL << RCM_APB1RST_PMURST_Pos)                              /*!< 0x10000000 */
#define RCM_APB1RST_PMURST                                          RCM_APB1RST_PMURST_Msk
#define RCM_APB1RST_DACRST_Pos                                      (29U)
#define RCM_APB1RST_DACRST_Msk                                      (0x1UL << RCM_APB1RST_DACRST_Pos)                              /*!< 0x20000000 */
#define RCM_APB1RST_DACRST                                          RCM_APB1RST_DACRST_Msk

