LuckkMaker/betaflight/lib/main/APM32F4/Libraries/Device/Geehy/APM32F4xx/Include/apm32f423xx.h
#define RCM_BDCTRL_RTCCLKEN_Pos                                     (15U)
#define RCM_BDCTRL_RTCCLKEN_Msk                                     (0x1UL << RCM_BDCTRL_RTCCLKEN_Pos)                             /*!< 0x00008000 */
#define RCM_BDCTRL_RTCCLKEN                                         RCM_BDCTRL_RTCCLKEN_Msk
#define RCM_BDCTRL_BDRST_Pos                                        (16U)
#define RCM_BDCTRL_BDRST_Msk                                        (0x1UL << RCM_BDCTRL_BDRST_Pos)                                /*!< 0x00010000 */
#define RCM_BDCTRL_BDRST                                            RCM_BDCTRL_BDRST_Msk

/********************  Bit definition for RCM_CSTS register  *******************/
#define RCM_CSTS_LSIEN_Pos                                          (0U)
#define RCM_CSTS_LSIEN_Msk                                          (0x1UL << RCM_CSTS_LSIEN_Pos)                                  /*!< 0x00000001 */
#define RCM_CSTS_LSIEN                                              RCM_CSTS_LSIEN_Msk
#define RCM_CSTS_LSIRDYFLG_Pos                                      (1U)
#define RCM_CSTS_LSIRDYFLG_Msk                                      (0x1UL << RCM_CSTS_LSIRDYFLG_Pos)                              /*!< 0x00000002 */
#define RCM_CSTS_LSIRDYFLG                                          RCM_CSTS_LSIRDYFLG_Msk
#define RCM_CSTS_RSTFLGCLR_Pos                                      (24U)
#define RCM_CSTS_RSTFLGCLR_Msk                                      (0x1UL << RCM_CSTS_RSTFLGCLR_Pos)                              /*!< 0x01000000 */
#define RCM_CSTS_RSTFLGCLR                                          RCM_CSTS_RSTFLGCLR_Msk
#define RCM_CSTS_BORRSTFLG_Pos                                      (25U)
#define RCM_CSTS_BORRSTFLG_Msk                                      (0x1UL << RCM_CSTS_BORRSTFLG_Pos)                              /*!< 0x02000000 */
#define RCM_CSTS_BORRSTFLG                                          RCM_CSTS_BORRSTFLG_Msk
#define RCM_CSTS_PINRSTFLG_Pos                                      (26U)
#define RCM_CSTS_PINRSTFLG_Msk                                      (0x1UL << RCM_CSTS_PINRSTFLG_Pos)                              /*!< 0x04000000 */
#define RCM_CSTS_PINRSTFLG                                          RCM_CSTS_PINRSTFLG_Msk
#define RCM_CSTS_PODRSTFLG_Pos                                      (27U)
#define RCM_CSTS_PODRSTFLG_Msk                                      (0x1UL << RCM_CSTS_PODRSTFLG_Pos)                              /*!< 0x08000000 */
#define RCM_CSTS_PODRSTFLG                                          RCM_CSTS_PODRSTFLG_Msk
#define RCM_CSTS_SWRSTFLG_Pos                                       (28U)
#define RCM_CSTS_SWRSTFLG_Msk                                       (0x1UL << RCM_CSTS_SWRSTFLG_Pos)                               /*!< 0x10000000 */
#define RCM_CSTS_SWRSTFLG                                           RCM_CSTS_SWRSTFLG_Msk
#define RCM_CSTS_IWDTRSTFLG_Pos                                     (29U)
#define RCM_CSTS_IWDTRSTFLG_Msk                                     (0x1UL << RCM_CSTS_IWDTRSTFLG_Pos)                             /*!< 0x20000000 */
#define RCM_CSTS_IWDTRSTFLG                                         RCM_CSTS_IWDTRSTFLG_Msk
#define RCM_CSTS_WWDTRSTFLG_Pos                                     (30U)
#define RCM_CSTS_WWDTRSTFLG_Msk                                     (0x1UL << RCM_CSTS_WWDTRSTFLG_Pos)                             /*!< 0x40000000 */
#define RCM_CSTS_WWDTRSTFLG                                         RCM_CSTS_WWDTRSTFLG_Msk
#define RCM_CSTS_LPWRRSTFLG_Pos                                     (31U)
#define RCM_CSTS_LPWRRSTFLG_Msk                                     (0x1UL << RCM_CSTS_LPWRRSTFLG_Pos)                             /*!< 0x80000000 */
#define RCM_CSTS_LPWRRSTFLG                                         RCM_CSTS_LPWRRSTFLG_Msk
/* Legacy defines */
#define RCM_CSTS_PADRSTF                                            RCM_CSTS_PINRSTFLG
#define RCM_CSTS_WDGRSTF                                            RCM_CSTS_IWDTRSTFLG

/********************  Bit definition for RCM_SSCCFG register  *****************/
#define RCM_SSCCFG_MODPCFG_Pos                                      (0U)
#define RCM_SSCCFG_MODPCFG_Msk                                      (0x1FFFUL << RCM_SSCCFG_MODPCFG_Pos)                           /*!< 0x00001FFF */
#define RCM_SSCCFG_MODPCFG                                          RCM_SSCCFG_MODPCFG_Msk
#define RCM_SSCCFG_STEP_Pos                                         (13U)
#define RCM_SSCCFG_STEP_Msk                                         (0x7FFFUL << RCM_SSCCFG_STEP_Pos)                              /*!< 0x0FFFE000 */
#define RCM_SSCCFG_STEP                                             RCM_SSCCFG_STEP_Msk
#define RCM_SSCCFG_SSSEL_Pos                                        (30U)
#define RCM_SSCCFG_SSSEL_Msk                                        (0x1UL << RCM_SSCCFG_SSSEL_Pos)                                /*!< 0x40000000 */
#define RCM_SSCCFG_SSSEL                                            RCM_SSCCFG_SSSEL_Msk
#define RCM_SSCCFG_SSEN_Pos                                         (31U)
#define RCM_SSCCFG_SSEN_Msk                                         (0x1UL << RCM_SSCCFG_SSEN_Pos)                                 /*!< 0x80000000 */
#define RCM_SSCCFG_SSEN                                             RCM_SSCCFG_SSEN_Msk


/******************************************************************************/
/*                                                                            */
/*                                    RNG                                     */
/*                                                                            */
/******************************************************************************/
/********************  Bits definition for RNG_CTRL register  *******************/
#define RNG_CTRL_RNGEN_Pos                                          (2U)
#define RNG_CTRL_RNGEN_Msk                                          (0x1UL << RNG_CTRL_RNGEN_Pos)                                  /*!< 0x00000004 */
#define RNG_CTRL_RNGEN                                              RNG_CTRL_RNGEN_Msk
#define RNG_CTRL_INTEN_Pos                                          (3U)
#define RNG_CTRL_INTEN_Msk                                          (0x1UL << RNG_CTRL_INTEN_Pos)                                  /*!< 0x00000008 */
#define RNG_CTRL_INTEN                                              RNG_CTRL_INTEN_Msk

/********************  Bits definition for RNG_STS register  *******************/
#define RNG_STS_DATARDY_Pos                                         (0U)
#define RNG_STS_DATARDY_Msk                                         (0x1UL << RNG_STS_DATARDY_Pos)                                 /*!< 0x00000001 */
#define RNG_STS_DATARDY                                             RNG_STS_DATARDY_Msk
#define RNG_STS_CLKERCSTS_Pos                                       (1U)
#define RNG_STS_CLKERCSTS_Msk                                       (0x1UL << RNG_STS_CLKERCSTS_Pos)                               /*!< 0x00000002 */
#define RNG_STS_CLKERCSTS                                           RNG_STS_CLKERCSTS_Msk
#define RNG_STS_FSCSTS_Pos                                          (2U)
#define RNG_STS_FSCSTS_Msk                                          (0x1UL << RNG_STS_FSCSTS_Pos)                                  /*!< 0x00000004 */
#define RNG_STS_FSCSTS                                              RNG_STS_FSCSTS_Msk
#define RNG_STS_CLKERINT_Pos                                        (5U)
#define RNG_STS_CLKERINT_Msk                                        (0x1UL << RNG_STS_CLKERINT_Pos)                                /*!< 0x00000020 */
#define RNG_STS_CLKERINT                                            RNG_STS_CLKERINT_Msk
#define RNG_STS_FSINT_Pos                                           (6U)
#define RNG_STS_FSINT_Msk                                           (0x1UL << RNG_STS_FSINT_Pos)                                   /*!< 0x00000040 */
#define RNG_STS_FSINT                                               RNG_STS_FSINT_Msk

/******************************************************************************/
/*                                                                            */
/*                           Real-Time Clock (RTC)                            */
/*                                                                            */
/******************************************************************************/
/*
 * @brief Specific device feature definitions  (not present on all devices in the APM32F4 serie)
 */
#define RTC_ALARMA_SUPPORT                                                                                                         /*!< ALARMA feature support */
#define RTC_ALARMB_SUPPORT                                                                                                         /*!< ALARMA feature support */
#define RTC_TAMPER_SUPPORT                                                                                                         /*!< TAMPER feature support */
#define RTC_TIMESTAMP_SUPPORT                                                                                                      /*!< TIMESTAMP feature support */
#define RTC_CALENDAR_SUPPORT                                                                                                       /*!< CALENDAR feature support */
#define RTC_WAKEUP_SUPPORT                                                                                                         /*!< WAKEUP feature support */
#define RTC_CALIBRATION_SUPPORT                                                                                                    /*!< CALIBRATION feature support */
#define RTC_TIME_SUPPORT                                                                                                           /*!< TIME feature support */
/********************  Bits definition for RTC_TIME register  *******************/
#define RTC_TIME_TIMEFCFG_Pos                                       (22U)
#define RTC_TIME_TIMEFCFG_Msk                                       (0x1UL << RTC_TIME_TIMEFCFG_Pos)                               /*!< 0x00400000 */
#define RTC_TIME_TIMEFCFG                                           RTC_TIME_TIMEFCFG_Msk
#define RTC_TIME_HRT_Pos                                            (20U)
#define RTC_TIME_HRT_Msk                                            (0x3UL << RTC_TIME_HRT_Pos)                                    /*!< 0x00300000 */
#define RTC_TIME_HRT                                                RTC_TIME_HRT_Msk
#define RTC_TIME_HRT_0                                              (0x1UL << RTC_TIME_HRT_Pos)                                    /*!< 0x00100000 */
#define RTC_TIME_HRT_1                                              (0x2UL << RTC_TIME_HRT_Pos)                                    /*!< 0x00200000 */
#define RTC_TIME_HRU_Pos                                            (16U)
#define RTC_TIME_HRU_Msk                                            (0xFUL << RTC_TIME_HRU_Pos)                                    /*!< 0x000F0000 */
#define RTC_TIME_HRU                                                RTC_TIME_HRU_Msk
#define RTC_TIME_HRU_0                                              (0x1UL << RTC_TIME_HRU_Pos)                                    /*!< 0x00010000 */
#define RTC_TIME_HRU_1                                              (0x2UL << RTC_TIME_HRU_Pos)                                    /*!< 0x00020000 */
#define RTC_TIME_HRU_2                                              (0x4UL << RTC_TIME_HRU_Pos)                                    /*!< 0x00040000 */
#define RTC_TIME_HRU_3                                              (0x8UL << RTC_TIME_HRU_Pos)                                    /*!< 0x00080000 */
#define RTC_TIME_MINT_Pos                                           (12U)
#define RTC_TIME_MINT_Msk                                           (0x7UL << RTC_TIME_MINT_Pos)                                   /*!< 0x00007000 */
#define RTC_TIME_MINT                                               RTC_TIME_MINT_Msk
#define RTC_TIME_MINT_0                                             (0x1UL << RTC_TIME_MINT_Pos)                                   /*!< 0x00001000 */
#define RTC_TIME_MINT_1                                             (0x2UL << RTC_TIME_MINT_Pos)                                   /*!< 0x00002000 */
#define RTC_TIME_MINT_2                                             (0x4UL << RTC_TIME_MINT_Pos)                                   /*!< 0x00004000 */
#define RTC_TIME_MINU_Pos                                           (8U)
#define RTC_TIME_MINU_Msk                                           (0xFUL << RTC_TIME_MINU_Pos)                                   /*!< 0x00000F00 */
#define RTC_TIME_MINU                                               RTC_TIME_MINU_Msk
#define RTC_TIME_MINU_0                                             (0x1UL << RTC_TIME_MINU_Pos)                                   /*!< 0x00000100 */
#define RTC_TIME_MINU_1                                             (0x2UL << RTC_TIME_MINU_Pos)                                   /*!< 0x00000200 */
#define RTC_TIME_MINU_2                                             (0x4UL << RTC_TIME_MINU_Pos)                                   /*!< 0x00000400 */
#define RTC_TIME_MINU_3                                             (0x8UL << RTC_TIME_MINU_Pos)                                   /*!< 0x00000800 */
#define RTC_TIME_SECT_Pos                                           (4U)
#define RTC_TIME_SECT_Msk                                           (0x7UL << RTC_TIME_SECT_Pos)                                   /*!< 0x00000070 */
#define RTC_TIME_SECT                                               RTC_TIME_SECT_Msk
#define RTC_TIME_SECT_0                                             (0x1UL << RTC_TIME_SECT_Pos)                                   /*!< 0x00000010 */
#define RTC_TIME_SECT_1                                             (0x2UL << RTC_TIME_SECT_Pos)                                   /*!< 0x00000020 */
#define RTC_TIME_SECT_2                                             (0x4UL << RTC_TIME_SECT_Pos)                                   /*!< 0x00000040 */
#define RTC_TIME_SECU_Pos                                           (0U)
#define RTC_TIME_SECU_Msk                                           (0xFUL << RTC_TIME_SECU_Pos)                                   /*!< 0x0000000F */
#define RTC_TIME_SECU                                               RTC_TIME_SECU_Msk
#define RTC_TIME_SECU_0                                             (0x1UL << RTC_TIME_SECU_Pos)                                   /*!< 0x00000001 */
#define RTC_TIME_SECU_1                                             (0x2UL << RTC_TIME_SECU_Pos)                                   /*!< 0x00000002 */
#define RTC_TIME_SECU_2                                             (0x4UL << RTC_TIME_SECU_Pos)                                   /*!< 0x00000004 */
#define RTC_TIME_SECU_3                                             (0x8UL << RTC_TIME_SECU_Pos)                                   /*!< 0x00000008 */

/********************  Bits definition for RTC_DATE register  *******************/
#define RTC_DATE_YRT_Pos                                            (20U)
#define RTC_DATE_YRT_Msk                                            (0xFUL << RTC_DATE_YRT_Pos)                                    /*!< 0x00F00000 */
#define RTC_DATE_YRT                                                RTC_DATE_YRT_Msk
#define RTC_DATE_YRT_0                                              (0x1UL << RTC_DATE_YRT_Pos)                                    /*!< 0x00100000 */
#define RTC_DATE_YRT_1                                              (0x2UL << RTC_DATE_YRT_Pos)                                    /*!< 0x00200000 */
#define RTC_DATE_YRT_2                                              (0x4UL << RTC_DATE_YRT_Pos)                                    /*!< 0x00400000 */
#define RTC_DATE_YRT_3                                              (0x8UL << RTC_DATE_YRT_Pos)                                    /*!< 0x00800000 */
#define RTC_DATE_YRU_Pos                                            (16U)
#define RTC_DATE_YRU_Msk                                            (0xFUL << RTC_DATE_YRU_Pos)                                    /*!< 0x000F0000 */
#define RTC_DATE_YRU                                                RTC_DATE_YRU_Msk
#define RTC_DATE_YRU_0                                              (0x1UL << RTC_DATE_YRU_Pos)                                    /*!< 0x00010000 */
#define RTC_DATE_YRU_1                                              (0x2UL << RTC_DATE_YRU_Pos)                                    /*!< 0x00020000 */
#define RTC_DATE_YRU_2                                              (0x4UL << RTC_DATE_YRU_Pos)                                    /*!< 0x00040000 */
#define RTC_DATE_YRU_3                                              (0x8UL << RTC_DATE_YRU_Pos)                                    /*!< 0x00080000 */
#define RTC_DATE_WEEKSEL_Pos                                        (13U)
#define RTC_DATE_WEEKSEL_Msk                                        (0x7UL << RTC_DATE_WEEKSEL_Pos)                                /*!< 0x0000E000 */
#define RTC_DATE_WEEKSEL                                            RTC_DATE_WEEKSEL_Msk
#define RTC_DATE_WEEKSEL_0                                          (0x1UL << RTC_DATE_WEEKSEL_Pos)                                /*!< 0x00002000 */
#define RTC_DATE_WEEKSEL_1                                          (0x2UL << RTC_DATE_WEEKSEL_Pos)                                /*!< 0x00004000 */
#define RTC_DATE_WEEKSEL_2                                          (0x4UL << RTC_DATE_WEEKSEL_Pos)                                /*!< 0x00008000 */
#define RTC_DATE_MONT_Pos                                           (12U)
#define RTC_DATE_MONT_Msk                                           (0x1UL << RTC_DATE_MONT_Pos)                                   /*!< 0x00001000 */
#define RTC_DATE_MONT                                               RTC_DATE_MONT_Msk
#define RTC_DATE_MONU_Pos                                           (8U)
#define RTC_DATE_MONU_Msk                                           (0xFUL << RTC_DATE_MONU_Pos)                                   /*!< 0x00000F00 */
#define RTC_DATE_MONU                                               RTC_DATE_MONU_Msk
#define RTC_DATE_MONU_0                                             (0x1UL << RTC_DATE_MONU_Pos)                                   /*!< 0x00000100 */
#define RTC_DATE_MONU_1                                             (0x2UL << RTC_DATE_MONU_Pos)                                   /*!< 0x00000200 */
#define RTC_DATE_MONU_2                                             (0x4UL << RTC_DATE_MONU_Pos)                                   /*!< 0x00000400 */
#define RTC_DATE_MONU_3                                             (0x8UL << RTC_DATE_MONU_Pos)                                   /*!< 0x00000800 */
#define RTC_DATE_DAYT_Pos                                           (4U)
#define RTC_DATE_DAYT_Msk                                           (0x3UL << RTC_DATE_DAYT_Pos)                                   /*!< 0x00000030 */
#define RTC_DATE_DAYT                                               RTC_DATE_DAYT_Msk
#define RTC_DATE_DAYT_0                                             (0x1UL << RTC_DATE_DAYT_Pos)                                   /*!< 0x00000010 */
#define RTC_DATE_DAYT_1                                             (0x2UL << RTC_DATE_DAYT_Pos)                                   /*!< 0x00000020 */
#define RTC_DATE_DAYU_Pos                                           (0U)
#define RTC_DATE_DAYU_Msk                                           (0xFUL << RTC_DATE_DAYU_Pos)                                   /*!< 0x0000000F */
#define RTC_DATE_DAYU                                               RTC_DATE_DAYU_Msk
#define RTC_DATE_DAYU_0                                             (0x1UL << RTC_DATE_DAYU_Pos)                                   /*!< 0x00000001 */
#define RTC_DATE_DAYU_1                                             (0x2UL << RTC_DATE_DAYU_Pos)                                   /*!< 0x00000002 */
#define RTC_DATE_DAYU_2                                             (0x4UL << RTC_DATE_DAYU_Pos)                                   /*!< 0x00000004 */
#define RTC_DATE_DAYU_3                                             (0x8UL << RTC_DATE_DAYU_Pos)                                   /*!< 0x00000008 */

