LuckkMaker/betaflight/lib/main/APM32F4/Libraries/Device/Geehy/APM32F4xx/Include/apm32f423xx.h
/********************  Bits definition for RTC_WRPROT register  ******************/
#define RTC_WRPROT_KEY_Pos                                          (0U)
#define RTC_WRPROT_KEY_Msk                                          (0xFFUL << RTC_WRPROT_KEY_Pos)                                 /*!< 0x000000FF */
#define RTC_WRPROT_KEY                                              RTC_WRPROT_KEY_Msk

/********************  Bits definition for RTC_SUBSEC register  ******************/
#define RTC_SUBSEC_SUBSEC_Pos                                       (0U)
#define RTC_SUBSEC_SUBSEC_Msk                                       (0xFFFFUL << RTC_SUBSEC_SUBSEC_Pos)                            /*!< 0x0000FFFF */
#define RTC_SUBSEC_SUBSEC                                           RTC_SUBSEC_SUBSEC_Msk

/********************  Bits definition for RTC_SHIFT register  ***************/
#define RTC_SHIFT_SFSEC_Pos                                         (0U)
#define RTC_SHIFT_SFSEC_Msk                                         (0x7FFFUL << RTC_SHIFT_SFSEC_Pos)                              /*!< 0x00007FFF */
#define RTC_SHIFT_SFSEC                                             RTC_SHIFT_SFSEC_Msk
#define RTC_SHIFT_ADD1SECEN_Pos                                     (31U)
#define RTC_SHIFT_ADD1SECEN_Msk                                     (0x1UL << RTC_SHIFT_ADD1SECEN_Pos)                             /*!< 0x80000000 */
#define RTC_SHIFT_ADD1SECEN                                         RTC_SHIFT_ADD1SECEN_Msk

/********************  Bits definition for RTC_TSTIME register  *****************/
#define RTC_TSTIME_TIMEFCFG_Pos                                     (22U)
#define RTC_TSTIME_TIMEFCFG_Msk                                     (0x1UL << RTC_TSTIME_TIMEFCFG_Pos)                             /*!< 0x00400000 */
#define RTC_TSTIME_TIMEFCFG                                         RTC_TSTIME_TIMEFCFG_Msk
#define RTC_TSTIME_HRT_Pos                                          (20U)
#define RTC_TSTIME_HRT_Msk                                          (0x3UL << RTC_TSTIME_HRT_Pos)                                  /*!< 0x00300000 */
#define RTC_TSTIME_HRT                                              RTC_TSTIME_HRT_Msk
#define RTC_TSTIME_HRT_0                                            (0x1UL << RTC_TSTIME_HRT_Pos)                                  /*!< 0x00100000 */
#define RTC_TSTIME_HRT_1                                            (0x2UL << RTC_TSTIME_HRT_Pos)                                  /*!< 0x00200000 */
#define RTC_TSTIME_HRU_Pos                                          (16U)
#define RTC_TSTIME_HRU_Msk                                          (0xFUL << RTC_TSTIME_HRU_Pos)                                  /*!< 0x000F0000 */
#define RTC_TSTIME_HRU                                              RTC_TSTIME_HRU_Msk
#define RTC_TSTIME_HRU_0                                            (0x1UL << RTC_TSTIME_HRU_Pos)                                  /*!< 0x00010000 */
#define RTC_TSTIME_HRU_1                                            (0x2UL << RTC_TSTIME_HRU_Pos)                                  /*!< 0x00020000 */
#define RTC_TSTIME_HRU_2                                            (0x4UL << RTC_TSTIME_HRU_Pos)                                  /*!< 0x00040000 */
#define RTC_TSTIME_HRU_3                                            (0x8UL << RTC_TSTIME_HRU_Pos)                                  /*!< 0x00080000 */
#define RTC_TSTIME_MINT_Pos                                         (12U)
#define RTC_TSTIME_MINT_Msk                                         (0x7UL << RTC_TSTIME_MINT_Pos)                                 /*!< 0x00007000 */
#define RTC_TSTIME_MINT                                             RTC_TSTIME_MINT_Msk
#define RTC_TSTIME_MINT_0                                           (0x1UL << RTC_TSTIME_MINT_Pos)                                 /*!< 0x00001000 */
#define RTC_TSTIME_MINT_1                                           (0x2UL << RTC_TSTIME_MINT_Pos)                                 /*!< 0x00002000 */
#define RTC_TSTIME_MINT_2                                           (0x4UL << RTC_TSTIME_MINT_Pos)                                 /*!< 0x00004000 */
#define RTC_TSTIME_MINU_Pos                                         (8U)
#define RTC_TSTIME_MINU_Msk                                         (0xFUL << RTC_TSTIME_MINU_Pos)                                 /*!< 0x00000F00 */
#define RTC_TSTIME_MINU                                             RTC_TSTIME_MINU_Msk
#define RTC_TSTIME_MINU_0                                           (0x1UL << RTC_TSTIME_MINU_Pos)                                 /*!< 0x00000100 */
#define RTC_TSTIME_MINU_1                                           (0x2UL << RTC_TSTIME_MINU_Pos)                                 /*!< 0x00000200 */
#define RTC_TSTIME_MINU_2                                           (0x4UL << RTC_TSTIME_MINU_Pos)                                 /*!< 0x00000400 */
#define RTC_TSTIME_MINU_3                                           (0x8UL << RTC_TSTIME_MINU_Pos)                                 /*!< 0x00000800 */
#define RTC_TSTIME_SECT_Pos                                         (4U)
#define RTC_TSTIME_SECT_Msk                                         (0x7UL << RTC_TSTIME_SECT_Pos)                                 /*!< 0x00000070 */
#define RTC_TSTIME_SECT                                             RTC_TSTIME_SECT_Msk
#define RTC_TSTIME_SECT_0                                           (0x1UL << RTC_TSTIME_SECT_Pos)                                 /*!< 0x00000010 */
#define RTC_TSTIME_SECT_1                                           (0x2UL << RTC_TSTIME_SECT_Pos)                                 /*!< 0x00000020 */
#define RTC_TSTIME_SECT_2                                           (0x4UL << RTC_TSTIME_SECT_Pos)                                 /*!< 0x00000040 */
#define RTC_TSTIME_SECU_Pos                                         (0U)
#define RTC_TSTIME_SECU_Msk                                         (0xFUL << RTC_TSTIME_SECU_Pos)                                 /*!< 0x0000000F */
#define RTC_TSTIME_SECU                                             RTC_TSTIME_SECU_Msk
#define RTC_TSTIME_SECU_0                                           (0x1UL << RTC_TSTIME_SECU_Pos)                                 /*!< 0x00000001 */
#define RTC_TSTIME_SECU_1                                           (0x2UL << RTC_TSTIME_SECU_Pos)                                 /*!< 0x00000002 */
#define RTC_TSTIME_SECU_2                                           (0x4UL << RTC_TSTIME_SECU_Pos)                                 /*!< 0x00000004 */
#define RTC_TSTIME_SECU_3                                           (0x8UL << RTC_TSTIME_SECU_Pos)                                 /*!< 0x00000008 */

