LuckkMaker/betaflight/lib/main/APM32F4/Libraries/Device/Geehy/APM32F4xx/Include/apm32f423xx.h
#define USART_CTRL2_STOPCFG_Pos                                     (12U)
#define USART_CTRL2_STOPCFG_Msk                                     (0x3UL << USART_CTRL2_STOPCFG_Pos)                             /*!< 0x00003000 */
#define USART_CTRL2_STOPCFG                                         USART_CTRL2_STOPCFG_Msk                                        /*!<STOP[1:0] bits (STOP bits) */
#define USART_CTRL2_STOPCFG_0                                       (0x1UL << USART_CTRL2_STOPCFG_Pos)                             /*!< 0x1000 */
#define USART_CTRL2_STOPCFG_1                                       (0x2UL << USART_CTRL2_STOPCFG_Pos)                             /*!< 0x2000 */

#define USART_CTRL2_LINMEN_Pos                                      (14U)
#define USART_CTRL2_LINMEN_Msk                                      (0x1UL << USART_CTRL2_LINMEN_Pos)                              /*!< 0x00004000 */
#define USART_CTRL2_LINMEN                                          USART_CTRL2_LINMEN_Msk                                         /*!<LIN mode enable */

/******************  Bit definition for USART_CTRL3 register  *******************/
#define USART_CTRL3_ERRIEN_Pos                                      (0U)
#define USART_CTRL3_ERRIEN_Msk                                      (0x1UL << USART_CTRL3_ERRIEN_Pos)                              /*!< 0x00000001 */
#define USART_CTRL3_ERRIEN                                          USART_CTRL3_ERRIEN_Msk                                         /*!<Error Interrupt Enable      */
#define USART_CTRL3_IREN_Pos                                        (1U)
#define USART_CTRL3_IREN_Msk                                        (0x1UL << USART_CTRL3_IREN_Pos)                                /*!< 0x00000002 */
#define USART_CTRL3_IREN                                            USART_CTRL3_IREN_Msk                                           /*!<IrDA mode Enable            */
#define USART_CTRL3_IRLPEN_Pos                                      (2U)
#define USART_CTRL3_IRLPEN_Msk                                      (0x1UL << USART_CTRL3_IRLPEN_Pos)                              /*!< 0x00000004 */
#define USART_CTRL3_IRLPEN                                          USART_CTRL3_IRLPEN_Msk                                         /*!<IrDA Low-Power              */
#define USART_CTRL3_HDEN_Pos                                        (3U)
#define USART_CTRL3_HDEN_Msk                                        (0x1UL << USART_CTRL3_HDEN_Pos)                                /*!< 0x00000008 */
#define USART_CTRL3_HDEN                                            USART_CTRL3_HDEN_Msk                                           /*!<Half-Duplex Selection       */
#define USART_CTRL3_SCNACKEN_Pos                                    (4U)
#define USART_CTRL3_SCNACKEN_Msk                                    (0x1UL << USART_CTRL3_SCNACKEN_Pos)                            /*!< 0x00000010 */
#define USART_CTRL3_SCNACKEN                                        USART_CTRL3_SCNACKEN_Msk                                       /*!<Smartcard NACK enable       */
#define USART_CTRL3_SCEN_Pos                                        (5U)
#define USART_CTRL3_SCEN_Msk                                        (0x1UL << USART_CTRL3_SCEN_Pos)                                /*!< 0x00000020 */
#define USART_CTRL3_SCEN                                            USART_CTRL3_SCEN_Msk                                           /*!<Smartcard mode enable       */
#define USART_CTRL3_DMARXEN_Pos                                     (6U)
#define USART_CTRL3_DMARXEN_Msk                                     (0x1UL << USART_CTRL3_DMARXEN_Pos)                             /*!< 0x00000040 */
#define USART_CTRL3_DMARXEN                                         USART_CTRL3_DMARXEN_Msk                                        /*!<DMA Enable Receiver         */
#define USART_CTRL3_DMATXEN_Pos                                     (7U)
#define USART_CTRL3_DMATXEN_Msk                                     (0x1UL << USART_CTRL3_DMATXEN_Pos)                             /*!< 0x00000080 */
#define USART_CTRL3_DMATXEN                                         USART_CTRL3_DMATXEN_Msk                                        /*!<DMA Enable Transmitter      */
#define USART_CTRL3_RTSEN_Pos                                       (8U)
#define USART_CTRL3_RTSEN_Msk                                       (0x1UL << USART_CTRL3_RTSEN_Pos)                               /*!< 0x00000100 */
#define USART_CTRL3_RTSEN                                           USART_CTRL3_RTSEN_Msk                                          /*!<RTS Enable                  */
#define USART_CTRL3_CTSEN_Pos                                       (9U)
#define USART_CTRL3_CTSEN_Msk                                       (0x1UL << USART_CTRL3_CTSEN_Pos)                               /*!< 0x00000200 */
#define USART_CTRL3_CTSEN                                           USART_CTRL3_CTSEN_Msk                                          /*!<CTS Enable                  */
#define USART_CTRL3_CTSIEN_Pos                                      (10U)
#define USART_CTRL3_CTSIEN_Msk                                      (0x1UL << USART_CTRL3_CTSIEN_Pos)                              /*!< 0x00000400 */
#define USART_CTRL3_CTSIEN                                          USART_CTRL3_CTSIEN_Msk                                         /*!<CTS Interrupt Enable        */
#define USART_CTRL3_SAMCFG_Pos                                      (11U)
#define USART_CTRL3_SAMCFG_Msk                                      (0x1UL << USART_CTRL3_SAMCFG_Pos)                              /*!< 0x00000800 */
#define USART_CTRL3_SAMCFG                                          USART_CTRL3_SAMCFG_Msk                                         /*!<USART One bit method enable */

/******************  Bit definition for USART_GTPSC register  ******************/
#define USART_GTPSC_PSC_Pos                                         (0U)
#define USART_GTPSC_PSC_Msk                                         (0xFFUL << USART_GTPSC_PSC_Pos)                                /*!< 0x000000FF */
#define USART_GTPSC_PSC                                             USART_GTPSC_PSC_Msk                                            /*!<PSC[7:0] bits (Prescaler value) */
#define USART_GTPSC_PSC_0                                           (0x01UL << USART_GTPSC_PSC_Pos)                                /*!< 0x0001 */
#define USART_GTPSC_PSC_1                                           (0x02UL << USART_GTPSC_PSC_Pos)                                /*!< 0x0002 */
#define USART_GTPSC_PSC_2                                           (0x04UL << USART_GTPSC_PSC_Pos)                                /*!< 0x0004 */
#define USART_GTPSC_PSC_3                                           (0x08UL << USART_GTPSC_PSC_Pos)                                /*!< 0x0008 */
#define USART_GTPSC_PSC_4                                           (0x10UL << USART_GTPSC_PSC_Pos)                                /*!< 0x0010 */
#define USART_GTPSC_PSC_5                                           (0x20UL << USART_GTPSC_PSC_Pos)                                /*!< 0x0020 */
#define USART_GTPSC_PSC_6                                           (0x40UL << USART_GTPSC_PSC_Pos)                                /*!< 0x0040 */
#define USART_GTPSC_PSC_7                                           (0x80UL << USART_GTPSC_PSC_Pos)                                /*!< 0x0080 */

#define USART_GTPSC_GRDT_Pos                                        (8U)
#define USART_GTPSC_GRDT_Msk                                        (0xFFUL << USART_GTPSC_GRDT_Pos)                               /*!< 0x0000FF00 */
#define USART_GTPSC_GRDT                                            USART_GTPSC_GRDT_Msk                                           /*!<Guard time value */

/******************************************************************************/
/*                                                                            */
/*                            Window WATCHDOG                                 */
/*                                                                            */
/******************************************************************************/
/*******************  Bit definition for WWDT_CTRL register  ********************/
#define WWDT_CTRL_CNT_Pos                                           (0U)
#define WWDT_CTRL_CNT_Msk                                           (0x7FUL << WWDT_CTRL_CNT_Pos)                                  /*!< 0x0000007F */
#define WWDT_CTRL_CNT                                               WWDT_CTRL_CNT_Msk                                              /*!<T[6:0] bits (7-Bit counter (MSB to LSB)) */
#define WWDT_CTRL_CNT_0                                             (0x01UL << WWDT_CTRL_CNT_Pos)                                  /*!< 0x01 */
#define WWDT_CTRL_CNT_1                                             (0x02UL << WWDT_CTRL_CNT_Pos)                                  /*!< 0x02 */
#define WWDT_CTRL_CNT_2                                             (0x04UL << WWDT_CTRL_CNT_Pos)                                  /*!< 0x04 */
#define WWDT_CTRL_CNT_3                                             (0x08UL << WWDT_CTRL_CNT_Pos)                                  /*!< 0x08 */
#define WWDT_CTRL_CNT_4                                             (0x10UL << WWDT_CTRL_CNT_Pos)                                  /*!< 0x10 */
#define WWDT_CTRL_CNT_5                                             (0x20UL << WWDT_CTRL_CNT_Pos)                                  /*!< 0x20 */
#define WWDT_CTRL_CNT_6                                             (0x40UL << WWDT_CTRL_CNT_Pos)                                  /*!< 0x40 */
/* Legacy defines */
#define WWDT_CTRL_CNT0                                              WWDT_CTRL_CNT_0
#define WWDT_CTRL_CNT1                                              WWDT_CTRL_CNT_1
#define WWDT_CTRL_CNT2                                              WWDT_CTRL_CNT_2
#define WWDT_CTRL_CNT3                                              WWDT_CTRL_CNT_3
#define WWDT_CTRL_CNT4                                              WWDT_CTRL_CNT_4
#define WWDT_CTRL_CNT5                                              WWDT_CTRL_CNT_5
#define WWDT_CTRL_CNT6                                              WWDT_CTRL_CNT_6

#define WWDT_CTRL_WWDTEN_Pos                                        (7U)
#define WWDT_CTRL_WWDTEN_Msk                                        (0x1UL << WWDT_CTRL_WWDTEN_Pos)                                /*!< 0x00000080 */
#define WWDT_CTRL_WWDTEN                                            WWDT_CTRL_WWDTEN_Msk                                           /*!<Activation bit */

/*******************  Bit definition for WWDT_CFG register  *******************/
#define WWDT_CFG_WIN_Pos                                            (0U)
#define WWDT_CFG_WIN_Msk                                            (0x7FUL << WWDT_CFG_WIN_Pos)                                   /*!< 0x0000007F */
#define WWDT_CFG_WIN                                                WWDT_CFG_WIN_Msk                                               /*!<W[6:0] bits (7-bit window value) */
#define WWDT_CFG_WIN_0                                              (0x01UL << WWDT_CFG_WIN_Pos)                                   /*!< 0x0001 */
#define WWDT_CFG_WIN_1                                              (0x02UL << WWDT_CFG_WIN_Pos)                                   /*!< 0x0002 */
#define WWDT_CFG_WIN_2                                              (0x04UL << WWDT_CFG_WIN_Pos)                                   /*!< 0x0004 */
#define WWDT_CFG_WIN_3                                              (0x08UL << WWDT_CFG_WIN_Pos)                                   /*!< 0x0008 */
#define WWDT_CFG_WIN_4                                              (0x10UL << WWDT_CFG_WIN_Pos)                                   /*!< 0x0010 */
#define WWDT_CFG_WIN_5                                              (0x20UL << WWDT_CFG_WIN_Pos)                                   /*!< 0x0020 */
#define WWDT_CFG_WIN_6                                              (0x40UL << WWDT_CFG_WIN_Pos)                                   /*!< 0x0040 */
/* Legacy defines */
#define WWDT_CFG_WIN0                                               WWDT_CFG_WIN_0
#define WWDT_CFG_WIN1                                               WWDT_CFG_WIN_1
#define WWDT_CFG_WIN2                                               WWDT_CFG_WIN_2
#define WWDT_CFG_WIN3                                               WWDT_CFG_WIN_3
#define WWDT_CFG_WIN4                                               WWDT_CFG_WIN_4
#define WWDT_CFG_WIN5                                               WWDT_CFG_WIN_5
#define WWDT_CFG_WIN6                                               WWDT_CFG_WIN_6

#define WWDT_CFG_TBPSC_Pos                                          (7U)
#define WWDT_CFG_TBPSC_Msk                                          (0x3UL << WWDT_CFG_TBPSC_Pos)                                  /*!< 0x00000180 */
#define WWDT_CFG_TBPSC                                              WWDT_CFG_TBPSC_Msk                                             /*!<WDGTB[1:0] bits (Timer Base) */
#define WWDT_CFG_TBPSC_0                                            (0x1UL << WWDT_CFG_TBPSC_Pos)                                  /*!< 0x0080 */
#define WWDT_CFG_TBPSC_1                                            (0x2UL << WWDT_CFG_TBPSC_Pos)                                  /*!< 0x0100 */
/* Legacy defines */
#define WWDT_CFG_TBPSC0                                             WWDT_CFG_TBPSC_0
#define WWDT_CFG_TBPSC1                                             WWDT_CFG_TBPSC_1

#define WWDT_CFG_EWIEN_Pos                                          (9U)
#define WWDT_CFG_EWIEN_Msk                                          (0x1UL << WWDT_CFG_EWIEN_Pos)                                  /*!< 0x00000200 */
#define WWDT_CFG_EWIEN                                              WWDT_CFG_EWIEN_Msk                                             /*!<Early Wakeup Interrupt */

/*******************  Bit definition for WWDT_STS register  ********************/
#define WWDT_STS_EWIFLG_Pos                                         (0U)
#define WWDT_STS_EWIFLG_Msk                                         (0x1UL << WWDT_STS_EWIFLG_Pos)                                 /*!< 0x00000001 */
#define WWDT_STS_EWIFLG                                             WWDT_STS_EWIFLG_Msk                                            /*!<Early Wakeup Interrupt Flag */


/******************************************************************************/
/*                                                                            */
/*                                DBG                                         */
/*                                                                            */
/******************************************************************************/
/********************  Bit definition for DBGMCU_IDCODE register  *************/
#define DBGMCU_IDCODE_EQR_Pos                                       (0U)
#define DBGMCU_IDCODE_EQR_Msk                                       (0xFFFUL << DBGMCU_IDCODE_EQR_Pos)                             /*!< 0x00000FFF */
#define DBGMCU_IDCODE_EQR                                           DBGMCU_IDCODE_EQR_Msk
#define DBGMCU_IDCODE_WVR_Pos                                       (16U)
#define DBGMCU_IDCODE_WVR_Msk                                       (0xFFFFUL << DBGMCU_IDCODE_WVR_Pos)                            /*!< 0xFFFF0000 */
#define DBGMCU_IDCODE_WVR                                           DBGMCU_IDCODE_WVR_Msk

