LuckkMaker/betaflight/lib/main/APM32F4/Libraries/Device/Geehy/APM32F4xx/Include/apm32f423xx.h
/********************  Bit definition for USB_OTG_DAEPINT register  ********************/
#define USB_OTG_DAEPINT_INEPINT_Pos                                 (0U)
#define USB_OTG_DAEPINT_INEPINT_Msk                                 (0xFFFFUL << USB_OTG_DAEPINT_INEPINT_Pos)                      /*!< 0x0000FFFF */
#define USB_OTG_DAEPINT_INEPINT                                     USB_OTG_DAEPINT_INEPINT_Msk                                    /*!< IN endpoint interrupt bits  */
#define USB_OTG_DAEPINT_OUTEPINT_Pos                                (16U)
#define USB_OTG_DAEPINT_OUTEPINT_Msk                                (0xFFFFUL << USB_OTG_DAEPINT_OUTEPINT_Pos)                     /*!< 0xFFFF0000 */
#define USB_OTG_DAEPINT_OUTEPINT                                    USB_OTG_DAEPINT_OUTEPINT_Msk                                   /*!< OUT endpoint interrupt bits */

/********************  Bit definition for USB_OTG_HACHIMASK register  ********************/
#define USB_OTG_HACHIMASK_ACHIMASK_Pos                              (0U)
#define USB_OTG_HACHIMASK_ACHIMASK_Msk                              (0xFFFFUL << USB_OTG_HACHIMASK_ACHIMASK_Pos)                   /*!< 0x0000FFFF */
#define USB_OTG_HACHIMASK_ACHIMASK                                  USB_OTG_HACHIMASK_ACHIMASK_Msk                                 /*!< Channel interrupt mask */

/********************  Bit definition for USB_OTG_GRXSTSP register  ********************/
#define USB_OTG_GRXSTSP_EPNUM_Pos                                   (0U)
#define USB_OTG_GRXSTSP_EPNUM_Msk                                   (0xFUL << USB_OTG_GRXSTSP_EPNUM_Pos)                           /*!< 0x0000000F */
#define USB_OTG_GRXSTSP_EPNUM                                       USB_OTG_GRXSTSP_EPNUM_Msk                                      /*!< IN EP interrupt mask bits  */
#define USB_OTG_GRXSTSP_BCNT_Pos                                    (4U)
#define USB_OTG_GRXSTSP_BCNT_Msk                                    (0x7FFUL << USB_OTG_GRXSTSP_BCNT_Pos)                          /*!< 0x00007FF0 */
#define USB_OTG_GRXSTSP_BCNT                                        USB_OTG_GRXSTSP_BCNT_Msk                                       /*!< OUT EP interrupt mask bits */
#define USB_OTG_GRXSTSP_DPID_Pos                                    (15U)
#define USB_OTG_GRXSTSP_DPID_Msk                                    (0x3UL << USB_OTG_GRXSTSP_DPID_Pos)                            /*!< 0x00018000 */
#define USB_OTG_GRXSTSP_DPID                                        USB_OTG_GRXSTSP_DPID_Msk                                       /*!< OUT EP interrupt mask bits */
#define USB_OTG_GRXSTSP_PSTS_Pos                                    (17U)
#define USB_OTG_GRXSTSP_PSTS_Msk                                    (0xFUL << USB_OTG_GRXSTSP_PSTS_Pos)                            /*!< 0x001E0000 */
#define USB_OTG_GRXSTSP_PSTS                                        USB_OTG_GRXSTSP_PSTS_Msk                                       /*!< OUT EP interrupt mask bits */

/********************  Bit definition for USB_OTG_DAEPIMASK register  ********************/
#define USB_OTG_DAEPIMASK_AINM_Pos                                  (0U)
#define USB_OTG_DAEPIMASK_AINM_Msk                                  (0xFFFFUL << USB_OTG_DAEPIMASK_AINM_Pos)                       /*!< 0x0000FFFF */
#define USB_OTG_DAEPIMASK_AINM                                      USB_OTG_DAEPIMASK_AINM_Msk                                     /*!< IN EP interrupt mask bits */
#define USB_OTG_DAEPIMASK_AOUTM_Pos                                 (16U)
#define USB_OTG_DAEPIMASK_AOUTM_Msk                                 (0xFFFFUL << USB_OTG_DAEPIMASK_AOUTM_Pos)                      /*!< 0xFFFF0000 */
#define USB_OTG_DAEPIMASK_AOUTM                                     USB_OTG_DAEPIMASK_AOUTM_Msk                                    /*!< OUT EP interrupt mask bits */

/********************  Bit definition for USB_OTG_GRXFIFO register  ********************/
#define USB_OTG_GRXFIFO_RXFDEP_Pos                                  (0U)
#define USB_OTG_GRXFIFO_RXFDEP_Msk                                  (0xFFFFUL << USB_OTG_GRXFIFO_RXFDEP_Pos)                       /*!< 0x0000FFFF */
#define USB_OTG_GRXFIFO_RXFDEP                                      USB_OTG_GRXFIFO_RXFDEP_Msk                                     /*!< RxFIFO depth */

/********************  Bit definition for USB_OTG_DVBUSDTIM register  ********************/
#define USB_OTG_DVBUSDTIM_VBUSDTIM_Pos                              (0U)
#define USB_OTG_DVBUSDTIM_VBUSDTIM_Msk                              (0xFFFFUL << USB_OTG_DVBUSDTIM_VBUSDTIM_Pos)                   /*!< 0x0000FFFF */
#define USB_OTG_DVBUSDTIM_VBUSDTIM                                  USB_OTG_DVBUSDTIM_VBUSDTIM_Msk                                 /*!< Device VBUS discharge time */

/********************  Bit definition for OTG register  ********************/
#define USB_OTG_NPTXSA_Pos                                          (0U)
#define USB_OTG_NPTXSA_Msk                                          (0xFFFFUL << USB_OTG_NPTXSA_Pos)                               /*!< 0x0000FFFF */
#define USB_OTG_NPTXSA                                              USB_OTG_NPTXSA_Msk                                             /*!< Nonperiodic transmit RAM start address */
#define USB_OTG_NPTXFDEP_Pos                                        (16U)
#define USB_OTG_NPTXFDEP_Msk                                        (0xFFFFUL << USB_OTG_NPTXFDEP_Pos)                             /*!< 0xFFFF0000 */
#define USB_OTG_NPTXFDEP                                            USB_OTG_NPTXFDEP_Msk                                           /*!< Nonperiodic TxFIFO depth               */
#define USB_OTG_TX0FSA_Pos                                          (0U)
#define USB_OTG_TX0FSA_Msk                                          (0xFFFFUL << USB_OTG_TX0FSA_Pos)                               /*!< 0x0000FFFF */
#define USB_OTG_TX0FSA                                              USB_OTG_TX0FSA_Msk                                             /*!< Endpoint 0 transmit RAM start address  */
#define USB_OTG_TX0FD_Pos                                           (16U)
#define USB_OTG_TX0FD_Msk                                           (0xFFFFUL << USB_OTG_TX0FD_Pos)                                /*!< 0xFFFF0000 */
#define USB_OTG_TX0FD                                               USB_OTG_TX0FD_Msk                                              /*!< Endpoint 0 TxFIFO depth                */

