LuckkMaker/betaflight/lib/main/APM32F4/Libraries/Device/Geehy/APM32F4xx/Include/apm32f423xx.h
/********************  Bit definition for USB_OTG_DIN1IMASK register  ********************/
#define USB_OTG_DIN1IMASK_TSFCMPM_Pos                               (0U)
#define USB_OTG_DIN1IMASK_TSFCMPM_Msk                               (0x1UL << USB_OTG_DIN1IMASK_TSFCMPM_Pos)                       /*!< 0x00000001 */
#define USB_OTG_DIN1IMASK_TSFCMPM                                   USB_OTG_DIN1IMASK_TSFCMPM_Msk                                  /*!< Transfer completed interrupt mask                 */
#define USB_OTG_DIN1IMASK_EPDISM_Pos                                (1U)
#define USB_OTG_DIN1IMASK_EPDISM_Msk                                (0x1UL << USB_OTG_DIN1IMASK_EPDISM_Pos)                        /*!< 0x00000002 */
#define USB_OTG_DIN1IMASK_EPDISM                                    USB_OTG_DIN1IMASK_EPDISM_Msk                                   /*!< Endpoint disabled interrupt mask                  */
#define USB_OTG_DIN1IMASK_TOM_Pos                                   (3U)
#define USB_OTG_DIN1IMASK_TOM_Msk                                   (0x1UL << USB_OTG_DIN1IMASK_TOM_Pos)                           /*!< 0x00000008 */
#define USB_OTG_DIN1IMASK_TOM                                       USB_OTG_DIN1IMASK_TOM_Msk                                      /*!< Timeout condition mask (nonisochronous endpoints) */
#define USB_OTG_DIN1IMASK_ITXEMPM_Pos                               (4U)
#define USB_OTG_DIN1IMASK_ITXEMPM_Msk                               (0x1UL << USB_OTG_DIN1IMASK_ITXEMPM_Pos)                       /*!< 0x00000010 */
#define USB_OTG_DIN1IMASK_ITXEMPM                                   USB_OTG_DIN1IMASK_ITXEMPM_Msk                                  /*!< IN token received when TxFIFO empty mask          */
#define USB_OTG_DIN1IMASK_IEPMMM_Pos                                (5U)
#define USB_OTG_DIN1IMASK_IEPMMM_Msk                                (0x1UL << USB_OTG_DIN1IMASK_IEPMMM_Pos)                        /*!< 0x00000020 */
#define USB_OTG_DIN1IMASK_IEPMMM                                    USB_OTG_DIN1IMASK_IEPMMM_Msk                                   /*!< IN token received with EP mismatch mask           */
#define USB_OTG_DIN1IMASK_IEPNAKEM_Pos                              (6U)
#define USB_OTG_DIN1IMASK_IEPNAKEM_Msk                              (0x1UL << USB_OTG_DIN1IMASK_IEPNAKEM_Pos)                      /*!< 0x00000040 */
#define USB_OTG_DIN1IMASK_IEPNAKEM                                  USB_OTG_DIN1IMASK_IEPNAKEM_Msk                                 /*!< IN endpoint NAK effective mask                    */
#define USB_OTG_DIN1IMASK_TXFUDRM_Pos                               (8U)
#define USB_OTG_DIN1IMASK_TXFUDRM_Msk                               (0x1UL << USB_OTG_DIN1IMASK_TXFUDRM_Pos)                       /*!< 0x00000100 */
#define USB_OTG_DIN1IMASK_TXFUDRM                                   USB_OTG_DIN1IMASK_TXFUDRM_Msk                                  /*!< FIFO underrun mask                                */
#define USB_OTG_DIN1IMASK_BNAM_Pos                                  (9U)
#define USB_OTG_DIN1IMASK_BNAM_Msk                                  (0x1UL << USB_OTG_DIN1IMASK_BNAM_Pos)                          /*!< 0x00000200 */
#define USB_OTG_DIN1IMASK_BNAM                                      USB_OTG_DIN1IMASK_BNAM_Msk                                     /*!< BNA interrupt mask                                */
#define USB_OTG_DIN1IMASK_NAKM_Pos                                  (13U)
#define USB_OTG_DIN1IMASK_NAKM_Msk                                  (0x1UL << USB_OTG_DIN1IMASK_NAKM_Pos)                          /*!< 0x00002000 */
#define USB_OTG_DIN1IMASK_NAKM                                      USB_OTG_DIN1IMASK_NAKM_Msk                                     /*!< NAK interrupt mask                                */

/********************  Bit definition for USB_OTG_HPORTCSTS register  ********************/
#define USB_OTG_HPORTCSTS_PCNNTFLG_Pos                              (0U)
#define USB_OTG_HPORTCSTS_PCNNTFLG_Msk                              (0x1UL << USB_OTG_HPORTCSTS_PCNNTFLG_Pos)                      /*!< 0x00000001 */
#define USB_OTG_HPORTCSTS_PCNNTFLG                                  USB_OTG_HPORTCSTS_PCNNTFLG_Msk                                 /*!< Port connect status        */
#define USB_OTG_HPORTCSTS_PCINTFLG_Pos                              (1U)
#define USB_OTG_HPORTCSTS_PCINTFLG_Msk                              (0x1UL << USB_OTG_HPORTCSTS_PCINTFLG_Pos)                      /*!< 0x00000002 */
#define USB_OTG_HPORTCSTS_PCINTFLG                                  USB_OTG_HPORTCSTS_PCINTFLG_Msk                                 /*!< Port connect detected      */
#define USB_OTG_HPORTCSTS_PEN_Pos                                   (2U)
#define USB_OTG_HPORTCSTS_PEN_Msk                                   (0x1UL << USB_OTG_HPORTCSTS_PEN_Pos)                           /*!< 0x00000004 */
#define USB_OTG_HPORTCSTS_PEN                                       USB_OTG_HPORTCSTS_PEN_Msk                                      /*!< Port enable                */
#define USB_OTG_HPORTCSTS_PENCHG_Pos                                (3U)
#define USB_OTG_HPORTCSTS_PENCHG_Msk                                (0x1UL << USB_OTG_HPORTCSTS_PENCHG_Pos)                        /*!< 0x00000008 */
#define USB_OTG_HPORTCSTS_PENCHG                                    USB_OTG_HPORTCSTS_PENCHG_Msk                                   /*!< Port enable/disable change */
#define USB_OTG_HPORTCSTS_POVC_Pos                                  (4U)
#define USB_OTG_HPORTCSTS_POVC_Msk                                  (0x1UL << USB_OTG_HPORTCSTS_POVC_Pos)                          /*!< 0x00000010 */
#define USB_OTG_HPORTCSTS_POVC                                      USB_OTG_HPORTCSTS_POVC_Msk                                     /*!< Port overcurrent active    */
#define USB_OTG_HPORTCSTS_POVCCHG_Pos                               (5U)
#define USB_OTG_HPORTCSTS_POVCCHG_Msk                               (0x1UL << USB_OTG_HPORTCSTS_POVCCHG_Pos)                       /*!< 0x00000020 */
#define USB_OTG_HPORTCSTS_POVCCHG                                   USB_OTG_HPORTCSTS_POVCCHG_Msk                                  /*!< Port overcurrent change    */
#define USB_OTG_HPORTCSTS_PRS_Pos                                   (6U)
#define USB_OTG_HPORTCSTS_PRS_Msk                                   (0x1UL << USB_OTG_HPORTCSTS_PRS_Pos)                           /*!< 0x00000040 */
#define USB_OTG_HPORTCSTS_PRS                                       USB_OTG_HPORTCSTS_PRS_Msk                                      /*!< Port resume                */
#define USB_OTG_HPORTCSTS_PSUS_Pos                                  (7U)
#define USB_OTG_HPORTCSTS_PSUS_Msk                                  (0x1UL << USB_OTG_HPORTCSTS_PSUS_Pos)                          /*!< 0x00000080 */
#define USB_OTG_HPORTCSTS_PSUS                                      USB_OTG_HPORTCSTS_PSUS_Msk                                     /*!< Port suspend               */
#define USB_OTG_HPORTCSTS_PRST_Pos                                  (8U)
#define USB_OTG_HPORTCSTS_PRST_Msk                                  (0x1UL << USB_OTG_HPORTCSTS_PRST_Pos)                          /*!< 0x00000100 */
#define USB_OTG_HPORTCSTS_PRST                                      USB_OTG_HPORTCSTS_PRST_Msk                                     /*!< Port reset                 */

#define USB_OTG_HPORTCSTS_PDLSTS_Pos                                (10U)
#define USB_OTG_HPORTCSTS_PDLSTS_Msk                                (0x3UL << USB_OTG_HPORTCSTS_PDLSTS_Pos)                        /*!< 0x00000C00 */
#define USB_OTG_HPORTCSTS_PDLSTS                                    USB_OTG_HPORTCSTS_PDLSTS_Msk                                   /*!< Port line status           */
#define USB_OTG_HPORTCSTS_PDLSTS_0                                  (0x1UL << USB_OTG_HPORTCSTS_PDLSTS_Pos)                        /*!< 0x00000400 */
#define USB_OTG_HPORTCSTS_PDLSTS_1                                  (0x2UL << USB_OTG_HPORTCSTS_PDLSTS_Pos)                        /*!< 0x00000800 */
#define USB_OTG_HPORTCSTS_PP_Pos                                    (12U)
#define USB_OTG_HPORTCSTS_PP_Msk                                    (0x1UL << USB_OTG_HPORTCSTS_PP_Pos)                            /*!< 0x00001000 */
#define USB_OTG_HPORTCSTS_PP                                        USB_OTG_HPORTCSTS_PP_Msk                                       /*!< Port power                 */

#define USB_OTG_HPORTCSTS_PTSEL_Pos                                 (13U)
#define USB_OTG_HPORTCSTS_PTSEL_Msk                                 (0xFUL << USB_OTG_HPORTCSTS_PTSEL_Pos)                         /*!< 0x0001E000 */
#define USB_OTG_HPORTCSTS_PTSEL                                     USB_OTG_HPORTCSTS_PTSEL_Msk                                    /*!< Port test control          */
#define USB_OTG_HPORTCSTS_PTSEL_0                                   (0x1UL << USB_OTG_HPORTCSTS_PTSEL_Pos)                         /*!< 0x00002000 */
#define USB_OTG_HPORTCSTS_PTSEL_1                                   (0x2UL << USB_OTG_HPORTCSTS_PTSEL_Pos)                         /*!< 0x00004000 */
#define USB_OTG_HPORTCSTS_PTSEL_2                                   (0x4UL << USB_OTG_HPORTCSTS_PTSEL_Pos)                         /*!< 0x00008000 */
#define USB_OTG_HPORTCSTS_PTSEL_3                                   (0x8UL << USB_OTG_HPORTCSTS_PTSEL_Pos)                         /*!< 0x00010000 */

