LuckkMaker/betaflight/lib/main/APM32F4/Libraries/Device/Geehy/APM32F4xx/Include/apm32f423xx.h
/* Legacy define */
/********************  Bit definition for OTG register  ********************/
#define USB_OTG_CHNUM_Pos                                           (0U)
#define USB_OTG_CHNUM_Msk                                           (0xFUL << USB_OTG_CHNUM_Pos)                                   /*!< 0x0000000F */
#define USB_OTG_CHNUM                                               USB_OTG_CHNUM_Msk                                              /*!< Channel number */
#define USB_OTG_CHNUM_0                                             (0x1UL << USB_OTG_CHNUM_Pos)                                   /*!< 0x00000001 */
#define USB_OTG_CHNUM_1                                             (0x2UL << USB_OTG_CHNUM_Pos)                                   /*!< 0x00000002 */
#define USB_OTG_CHNUM_2                                             (0x4UL << USB_OTG_CHNUM_Pos)                                   /*!< 0x00000004 */
#define USB_OTG_CHNUM_3                                             (0x8UL << USB_OTG_CHNUM_Pos)                                   /*!< 0x00000008 */
#define USB_OTG_BCNT_Pos                                            (4U)
#define USB_OTG_BCNT_Msk                                            (0x7FFUL << USB_OTG_BCNT_Pos)                                  /*!< 0x00007FF0 */
#define USB_OTG_BCNT                                                USB_OTG_BCNT_Msk                                               /*!< Byte count */

#define USB_OTG_DPID_Pos                                            (15U)
#define USB_OTG_DPID_Msk                                            (0x3UL << USB_OTG_DPID_Pos)                                    /*!< 0x00018000 */
#define USB_OTG_DPID                                                USB_OTG_DPID_Msk                                               /*!< Data PID */
#define USB_OTG_DPID_0                                              (0x1UL << USB_OTG_DPID_Pos)                                    /*!< 0x00008000 */
#define USB_OTG_DPID_1                                              (0x2UL << USB_OTG_DPID_Pos)                                    /*!< 0x00010000 */

#define USB_OTG_PKTSTS_Pos                                          (17U)
#define USB_OTG_PKTSTS_Msk                                          (0xFUL << USB_OTG_PKTSTS_Pos)                                  /*!< 0x001E0000 */
#define USB_OTG_PKTSTS                                              USB_OTG_PKTSTS_Msk                                             /*!< Packet status */
#define USB_OTG_PKTSTS_0                                            (0x1UL << USB_OTG_PKTSTS_Pos)                                  /*!< 0x00020000 */
#define USB_OTG_PKTSTS_1                                            (0x2UL << USB_OTG_PKTSTS_Pos)                                  /*!< 0x00040000 */
#define USB_OTG_PKTSTS_2                                            (0x4UL << USB_OTG_PKTSTS_Pos)                                  /*!< 0x00080000 */
#define USB_OTG_PKTSTS_3                                            (0x8UL << USB_OTG_PKTSTS_Pos)                                  /*!< 0x00100000 */

#define USB_OTG_EPNUM_Pos                                           (0U)
#define USB_OTG_EPNUM_Msk                                           (0xFUL << USB_OTG_EPNUM_Pos)                                   /*!< 0x0000000F */
#define USB_OTG_EPNUM                                               USB_OTG_EPNUM_Msk                                              /*!< Endpoint number */
#define USB_OTG_EPNUM_0                                             (0x1UL << USB_OTG_EPNUM_Pos)                                   /*!< 0x00000001 */
#define USB_OTG_EPNUM_1                                             (0x2UL << USB_OTG_EPNUM_Pos)                                   /*!< 0x00000002 */
#define USB_OTG_EPNUM_2                                             (0x4UL << USB_OTG_EPNUM_Pos)                                   /*!< 0x00000004 */
#define USB_OTG_EPNUM_3                                             (0x8UL << USB_OTG_EPNUM_Pos)                                   /*!< 0x00000008 */

#define USB_OTG_FRMNUM_Pos                                          (21U)
#define USB_OTG_FRMNUM_Msk                                          (0xFUL << USB_OTG_FRMNUM_Pos)                                  /*!< 0x01E00000 */
#define USB_OTG_FRMNUM                                              USB_OTG_FRMNUM_Msk                                             /*!< Frame number */
#define USB_OTG_FRMNUM_0                                            (0x1UL << USB_OTG_FRMNUM_Pos)                                  /*!< 0x00200000 */
#define USB_OTG_FRMNUM_1                                            (0x2UL << USB_OTG_FRMNUM_Pos)                                  /*!< 0x00400000 */
#define USB_OTG_FRMNUM_2                                            (0x4UL << USB_OTG_FRMNUM_Pos)                                  /*!< 0x00800000 */
#define USB_OTG_FRMNUM_3                                            (0x8UL << USB_OTG_FRMNUM_Pos)                                  /*!< 0x01000000 */

/**
  * @}
  */

/**
  * @}
  */

/** @addtogroup Exported_macros
  * @{
  */

/******************************* ADC Instances ********************************/
#define IS_ADC_ALL_INSTANCE(INSTANCE) (((INSTANCE) == ADC1) || \
                                       ((INSTANCE) == ADC2) || \
                                       ((INSTANCE) == ADC3))

#define IS_ADC_MULTIMODE_MASTER_INSTANCE(INSTANCE) ((INSTANCE) == ADC1)

#define IS_ADC_COMMON_INSTANCE(INSTANCE) ((INSTANCE) == ADC123_COMMON)

/******************************* CAN Instances ********************************/
#define IS_CAN_ALL_INSTANCE(INSTANCE) (((INSTANCE) == CAN1) || \
                                       ((INSTANCE) == CAN2))
/******************************* CRC Instances ********************************/
#define IS_CRC_ALL_INSTANCE(INSTANCE) ((INSTANCE) == CRC)

/******************************* DAC Instances ********************************/
#define IS_DAC_ALL_INSTANCE(INSTANCE) ((INSTANCE) == DAC1)

/******************************** DMA Instances *******************************/
#define IS_DMA_STREAM_ALL_INSTANCE(INSTANCE) (((INSTANCE) == DMA1_Stream0) || \
                                              ((INSTANCE) == DMA1_Stream1) || \
                                              ((INSTANCE) == DMA1_Stream2) || \
                                              ((INSTANCE) == DMA1_Stream3) || \
                                              ((INSTANCE) == DMA1_Stream4) || \
                                              ((INSTANCE) == DMA1_Stream5) || \
                                              ((INSTANCE) == DMA1_Stream6) || \
                                              ((INSTANCE) == DMA1_Stream7) || \
                                              ((INSTANCE) == DMA2_Stream0) || \
                                              ((INSTANCE) == DMA2_Stream1) || \
                                              ((INSTANCE) == DMA2_Stream2) || \
                                              ((INSTANCE) == DMA2_Stream3) || \
                                              ((INSTANCE) == DMA2_Stream4) || \
                                              ((INSTANCE) == DMA2_Stream5) || \
                                              ((INSTANCE) == DMA2_Stream6) || \
                                              ((INSTANCE) == DMA2_Stream7))

